{"1":{"No":"1","product_name":"1.5 Hp Titinum Coil. 14X16X14 Cm","price":"₹9800.00","category":"ACCESSORIES","image":"Titanium-Heat-Exchanger-Coil.jpg","description":"\nTitanium is an inert material, does not oxidise, and is resistant to rusting. This makes the cooling coil corrosion-resistant and highly suitable for use in any type of aquarium – freshwater, seawater, marine and reef tanks.\n"},"2":{"No":"2","product_name":"Alkalin 8.3 – 2ltr","price":"₹3480.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"website-1-598x598.jpg","description":"\nBrightwell Aquatics Alkalin 8.3 250 ml.\n"},"3":{"No":"3","product_name":"All In One Advanced Bio Pallets 500Ml","price":"₹3500.00","category":"WATER FILTERATION & TREATMENT","image":"All-in-One-Advanced-BioPellets-DVH-500-ml-598x598.jpg","description":"\nPreviously, we were the first to develop and present the NP reducing Biopellets which are mostly removing Nitrogen waste products and to a small extend also Phosphates. Where our competitors lifted on our success and sit back, we kept developing our product.\n"},"4":{"No":"4","product_name":"Aquarium tong","price":"₹1200.00","category":"ACCESSORIES","image":"download-2-598x639.jpg","description":""},"5":{"No":"5","product_name":"Aquascape","price":"₹22000.00","category":"AQUASCAPING ROCKS","image":"Aquascape-scaled-598x598.jpg","description":"\ncomprehensive line of ArtReef Rocks products and design. Our products are thoughtfully designed with you in mind: functional, useful and DIY-friendly. (And good-looking, of course.) Our products are artistically and passion driven made with quality and safe materials.\nSMALL , MEDIUM, LARGE Aquascape AVAILABLE\n"},"6":{"No":"6","product_name":"ARM Calcium Reactor Media EXTRA Coarse (1 Gallon) – Caribsea","price":"₹3250.00","category":"MEDIA & SANDS","image":"Arm-Extra-Coarse-1000x1000__46656-598x598.jpg","description":"\nCalcium reactors have evolved into several types that require different media sizes. Because of this we now offer ARM™ Coarse for rapid upflow type reactors that have become so popular. This coarse grade of ARM™ will prevent the clogging and upkeep associated with fine media and these reactors.  A high magnesium reactor media. ARM™ Extra Coarse is still a complete reactor media containing not only calcium and carbonate, but essential trace elements as well.\nContains:\n\n416000 ppm Calcium, 577000 ppm Carbonate, 3300 ppm Strontium, 1400 ppm Magnesium, 56 ppm Potassium.\nAbout 70 pounds per cubic foot\n1 gal (00529), 50 lb (00559)\n\n"},"7":{"No":"7","product_name":"Ati Carbo Ex Air Filter 1.5 Liter","price":"₹1400.00","category":"WATER FILTERATION & TREATMENT","image":"ATI-Carbo-Ex-aanzuigfilter-voor-afschuimers-verhoogt-pH-waarde-aangezogen-lucht.jpg","description":"\nCarbo Ex is a plug-and-play air filter that contains a fine dust filter in addition to the granulate for CO2 removal.\n"},"8":{"No":"8","product_name":"Ati Carbo Ex Air Filter 4 Liter","price":"₹6900.00","category":"WATER FILTERATION & TREATMENT","image":"ati-carbo-ex-air-filter-4-liter-incl-3250-g-granulate-598x752.png","description":"\nCarbo Ex is a plug and play air filter which, in addition to the granulate for CO2 removal, also contains a fine dust filter.\n"},"9":{"No":"9","product_name":"Ati Carbo Ex Reffil Pack 3250 Grm","price":"₹2100.00","category":"ACCESSORIES","image":"71u6pgPadzL._SL1000_-598x598.jpg","description":"\nThis product is for the ATI Carbo Ex 4 litre REFILLABLE unit is an air filter that connects to your protein skimmer as a ready to fit filter cartridge for up to 95% removal of CO2, and fine particles from the air supply, such as dust and pollens etc.\n"},"10":{"No":"10","product_name":"Ati Carbon Plus","price":"₹1800.00","category":"WATER FILTERATION & TREATMENT","image":"61QURhimnL._SL1000_-598x598.jpg","description":"\nATI Carbon plus is a new high-performance activated carbon having improved pore structure for crystal clear water in freshwater and saltwater aquariums. In a special manufacturing method, a plurality of fine capillaries is created. This large inner active surface area of 900 ? 1000 m? \/ g carbon can bind particularly quickly and efficiently plus pollutants\n1000ml \/ 2000ml\n"},"11":{"No":"11","product_name":"Ati Essentials Pro Set 2 X 2000Ml","price":"₹4500.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"71fa2D9F6lS._SL1500_-598x598.jpg","description":"\nEssentials pro is a revolutionary care system. Our experience from more than 20,000 seawater analyses has enabled us to further optimize the recipe of the successful Essentials. Essentials pro supplies your aquarium not only with all major elements (incl. KH, Ca and Mg), but also with all essential trace elements (e.g. iron, iodine, molybdenum, manganese, vanadium and zinc) and helps to keep them continuously in the optimal concentration range. With Essentials pro you replace 3 x 10 liters of conventional element supply. All relevant elements are already premixed in the two Essentials pro bottles. The concentrate in laboratory quality can also be dosed immediately and does not have to be diluted. Your reef aquarium is a unique aquatic ecosystem containing many different organisms. All these organisms continuously extract substances from the aquarium water in order to be able to grow. By supplying your aquarium with Essentials pro you are able to balance the typical consumption of the reef inhabitants according to demand and consumption. In this way natural water values are continuously maintained, which is the cornerstone for every successful reef aquarium. The production of our water care products is subject to strict monitoring by our own laboratory. Quality assurance helps us to select the purest raw materials and leads to a top-quality end product. With Essentials pro you get one of the purest products available on the market for supplying reef aquariums. Usually the essentials pro are consumed to the same extent. In this case, the dosage of Essentials pro 1 and 2 can be adjusted using the KH consumption of your tank. If the calcium value changes over time, the dosage of Essentials pro 2 should be adjusted based on the calcium consumption.\n"},"12":{"No":"12","product_name":"Ati Essentials Set 3 ? 1000Ml","price":"₹4950.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"51zcwSDUHaL.jpg","description":"\nDeveloped in the laboratory and formulated by using advanced analytics to the typical consumption of a tropical reef aquarium. With ATI.Lab Essentials range of products you get a complete support system that can be easily tailored to the needs of your aquarium. ATI Essentials include in addition to calcium, magnesium, carbonates all essential trace elements and thus fully support the biology of your aquarium. The formulation has been carefully developed in the laboratory and optimised with advanced analytics to be composed only of high-purity raw materials. This ensures that ATI Essentials is a first class and safe product for the care of your coral reef aquarium. With the balanced formulation of ATI Essentials, partial water changes to correct water chemistry or compensate for trace elements are no longer completely necessary, thus stability of all essential elements can be achieved. The benefits of this will be visible in the health and growth of the corals. So you will have more time to enjoy your aquarium whilst using the ATI Essentials.\n"},"13":{"No":"13","product_name":"Ati Phosphat Stop","price":"₹1400.00","category":"WATER FILTERATION & TREATMENT","image":"hjrjjrghjh.jpg","description":"\nBINDING PHOSPHATE RELIABLY AND PERMANENTLY ATI phosphate stop is a high-phosphate absorbers on iron hydroxide base. Phosphate is particularly effectively removed from the sea water, fresh water or pond water. Once bound phosphate cannot be removed. Even with a longer service life of the filter material no phosphate is transferred to the aquarium water. ATI phosphate stop is optimally suited for use in reef aquariums because it emits no pollutants to the water.\nAti Phosphat Stop – 1000ml, 2000ml, 5000ml.\n"},"14":{"No":"14","product_name":"Ati T5 Actinic","price":"₹2399.00","category":"AQUARIUM LIGHTS","image":"fdjkdfhkhd.jpg","description":"\nATI T5 bulbs have been at the forefront of T5 bulb technology since there 1st introduction in 2000. Since then, ATI engineers have continued to research and develop ways to make an even better T5 bulb.The new generation of T5 bulbs from ATI continue this tradition of excellence.?Unlike other brands, including other German-made (T5, ATI T5 bulbs, the use of the latest advances in phosphors phosphors are the things within the bulbs that emit light) coloring and manufacturing techniques to produce bulbs with superior output , better and more stability.?By using better quality phosphors and improved manufacturing techniques, the new versions of the ATI Plus Blue and ATI AquaBlue Specials have better output and better color over previous generations.?And since you know everything,?ATI has been proud to release the all new ATI Purple Plus Focus, which was developed to replace the ATI Pro Color.?Lastly, while also keeping the hobbyist in mind, ATI bulbs are also very affordable making them a great value and a preferred choice of experienced hobbyists everywhere.?Available colors: aquablue pico color blue: combines the properties of a broad spectrum of the special bulb with a high produces a bulb with a color temperature of approximately 15,000 K. Blue Plus: combines the properties of a bulb (approximately 460 nm) of Blue with an actinic focus (approximately 420nm) produces a blue light with high torque numbers and an intense light spectrum that stimulates both bluing in SPS corals and fluorescence in capable corals. True actinic:\nAti T5Actinic – 24, 39, 54watts.\n"},"15":{"No":"15","product_name":"Ati T5 Blue Plus","price":"₹2399.00","category":"AQUARIUM LIGHTS","image":"FHEEJJJFJEFG.jpg","description":"\nATI T5 bulbs have been at the forefront of T5 bulb technology since there 1st introduction in 2000. Since then, ATI engineers have continued to research and develop ways to make an even better T5 bulb.The new generation of T5 bulbs from ATI continue this tradition of excellence.?Unlike other brands, including other German-made (T5, ATI T5 bulbs, the use of the latest advances in phosphors phosphors are the things within the bulbs that emit light) coloring and manufacturing techniques to produce bulbs with superior output , better and more stability.?By using better quality phosphors and improved manufacturing techniques, the new versions of the ATI Plus Blue and ATI AquaBlue Specials have better output and better color over previous generations.?And since you know everything,?ATI has been proud to release the all new ATI Purple Plus Focus, which was developed to replace the ATI Pro Color.?Lastly, while also keeping the hobbyist in mind, ATI bulbs are also very affordable making them a great value and a preferred choice of experienced hobbyists everywhere.?Available colors: aquablue pico color blue: combines the properties of a broad spectrum of the special bulb with a high produces a bulb with a color temperature of approximately 15,000 K. Blue Plus: combines the properties of a bulb (approximately 460 nm) of Blue with an actinic focus (approximately 420nm) produces a blue light with high torque numbers and an intense light spectrum that stimulates both bluing in SPS corals and fluorescence in capable corals. True actinic:\n \nATI T5 BLUE PLUS – 24, 39, 54watt\n"},"16":{"No":"16","product_name":"Ati T5 Coral Plus","price":"₹2399.00","category":"AQUARIUM LIGHTS","image":"rgrgrghrg.jpg","description":"\nATI T5 bulbs have been at the forefront of T5 bulb technology since there 1st introduction in 2000. Since then, ATI engineers have continued to research and develop ways to make an even better T5 bulb.The new generation of T5 bulbs from ATI continue this tradition of excellence.?Unlike other brands, including other German-made (T5, ATI T5 bulbs, the use of the latest advances in phosphors phosphors are the things within the bulbs that emit light) coloring and manufacturing techniques to produce bulbs with superior output , better and more stability.?By using better quality phosphors and improved manufacturing techniques, the new versions of the ATI Plus Blue and ATI AquaBlue Specials have better output and better color over previous generations.?And since you know everything,?ATI has been proud to release the all new ATI Purple Plus Focus, which was developed to replace the ATI Pro Color.?Lastly, while also keeping the hobbyist in mind, ATI bulbs are also very affordable making them a great value and a preferred choice of experienced hobbyists everywhere.?Available colors: aquablue pico color blue: combines the properties of a broad spectrum of the special bulb with a high produces a bulb with a color temperature of approximately 15,000 K. Blue Plus: combines the properties of a bulb (approximately 460 nm) of Blue with an actinic focus (approximately 420nm) produces a blue light with high torque numbers and an intense light spectrum that stimulates both bluing in SPS corals and fluorescence in capable corals. True actinic:\nAti T5 Coral Plus – 24, 54watts.\n \n"},"17":{"No":"17","product_name":"Ati T5 Purple Plus","price":"₹2399.00","category":"AQUARIUM LIGHTS","image":"dhjddgd.jpg","description":"\nThe ATI Aquablue Special T5 HO Fluorescent bulb combines the properties of a full-spectrum bulb with an elevated blue color peak producing a bulb with an approximate color temperature of 15000K. Recommended Use: as a stand-alone bulb or in combination with Blue Plus, Purple Plus, True Actinic or other supplemental T5 bulbs.\nAti T5 Purple Plus – 24, 39watts\n"},"18":{"No":"18","product_name":"Blue Life Aiptasia Rx","price":"₹950.00","category":"WATER FILTERATION & TREATMENT","image":"232206-bluelife-aiptasia-rx-additive-inp-598x598.jpg","description":"\nAiptasia Rx from Blue Life is a simple, effective and fast solution for the treatment of Aiptasia and Majano anemones. This product works within minutes of application. Aiptasia RX is reef resistant and will not alter aquarium chemistry. When used as directed, it will not harm lower animals.\n"},"19":{"No":"19","product_name":"Blue Life Green Cyano Rx","price":"₹1500.00","category":"WATER FILTERATION & TREATMENT","image":"232212-bluelife-greencyano-rx-additive-inp-598x598.jpg","description":"\nBlue Life Green Cyano RX 30ml will quickly and effectively treat disease-causing cyano bacteria from rocks, plants, gravel and sand in your?freshwater aquarium\n"},"20":{"No":"20","product_name":"Blue Life Phosphate Rx","price":"₹1850.00","category":"WATER FILTERATION & TREATMENT","image":"232213-bluelife-phosphate-rx-additive-inp-598x598.jpg","description":"\nPhosphate rx is an amazing simple and effective product that has revolutionized the way phosphate are removed from saltwater and freshwater aquarium\n"},"21":{"No":"21","product_name":"Boost PH+ Increaser -250ml","price":"₹1090.00","category":"WATER FILTERATION & TREATMENT","image":"BRI01310-2__88338.1630690084-598x598.jpg","description":"\nBoost pH+ High Range pH Increaser, raises pH only without increasing alkalinity or calcium (in tanks already having a proper dKH)\nHigh range pH increaser for all marine aquaria, Allows maintaining a pH of 8.3, 8.4 or 8.5 in difficult tanks without raising alkalinity (when used as directed)\n"},"22":{"No":"22","product_name":"Bubble Magus Calcium Reactor","price":"₹17000.00","category":"MEDIA REACTORS","image":"hdhddgdg.jpg","description":"\nBubble Magus Calcium Reactor CR150WP Model: CR150 WP Pump : WP2000 Power : 110V ,40W Internal volume : 3.5L Size: 7.88 in x 11.11 in x 19.49 in, 200*282*495MM Capacity : 100-200 gallons, 400L-800L aquarium\nBubble Magus Calcium Reactor CR200 WP Model: CR200 WP Pump : WP2000 Power : 110V ,40W Internal volume : 6L Size: 9.06 in x 12.29 in x 21.46 in, 230*312*545MM Capacity : 200 – 400 gallons, 800L -1500L aquarium\nBubble Magus Calcium Reactor – Model – CR150 WP, CR200 WP.\n \n"},"23":{"No":"23","product_name":"Bubble Magus Protein Skimmer","price":"₹8650.00","category":"PROTEIN SKIMMER","image":"bubble-magus-cure-7-500x500-1.jpg","description":"\nBubble-Magus skimmers are practical and highly efficient. These skimmers offer innovative features along with reliable pumps at an affordable price: which makes them a great value.\nBubble Magus Protein Skimmer – curve 5, curve 7, curve 9.\n"},"24":{"No":"24","product_name":"Bubble Magus QQ2 Internal Nano Skimmer","price":"₹7400.00","category":"PROTEIN SKIMMER","image":"qq2-598x598.jpg","description":"\nBubble Magus QQ2 Internal Nano Skimmer\nBubble Magus QQ2 is a compact internal protein skimmer that can be used as a drop in skimmer with a minimum 4″ water level requirement. Plastic injected molded body with built in air silencer and bubble stopper.\n"},"25":{"No":"25","product_name":"Bubble Magus Roller Filter","price":"₹12500.00","category":"WATER FILTERATION & TREATMENT","image":"Capture-768.jpg","description":"\nBubble Magus Filter Roll The filter is a high-efficiency water filtration system which effectively removes suspended particles such as detritus, food, organic waste from the water column. The ARF removes the need for filter socks. Water is fed into the internal chamber via the aquarium systems drain, and through the filter roll. When the water level rises in the chamber due to filter clogging the water level switch triggers the motor to wind on the filter roll to a new fresh piece. The water level will then drop repeating the process Use in marine aquariums, freshwater aquariums and corals system. 12v DC motor 110v Power adapter ULc DC12v 1amp output Water level switch Filter roll Non woven 150mm width, 25M length 1? I.D inlet pipe, complete with Flex pipe 40x36x26cm total dimensions (including motor body) Internal sump mounted 12″ long x 15.5 wide by 14″ tall Water Flow: 400-500gph recommended.\nBubble Magus Roller Filter – Small , medium, large .\n"},"26":{"No":"26","product_name":"Bubble Magus Roller Filter Roll","price":"₹1050.00","category":"ACCESSORIES","image":"51aODidQKL._SX522_.jpg","description":"\nBUBBLE MAGUS ROLLER FILTER PAPER ROLLS\n"},"27":{"No":"27","product_name":"Bubble Magus Spare Pump for Protein Skimmer","price":"₹2600.00","category":"AQUARIUM PUMP & WAVE MAKER","image":"sjdsjg.jpg","description":"\nThe Bubble Magus SP1000 Spare Pump is suitable for the following Protein Skimmers curve 5\nThe Bubble Magus SP2000 Spare Pump is suitable for the following Protein Skimmers curve 7\nThe Bubble Magus SP4000 Spare Pump is suitable for the following Protein Skimmers curve 9\nSpare Pump – 1000, 2000, 4000.\n"},"28":{"No":"28","product_name":"Bubble Magus Wp1000 Reactor Pump","price":"₹2600.00","category":"AQUARIUM PUMP & WAVE MAKER","image":"Bubble-Magus-opvoerpomp-WP4000.jpg","description":"\nBubble Magus ROCK WP1000 pump is rated at 291gph, with a 5.5′ head pressure, and only draw 23 watt of power.\n"},"29":{"No":"29","product_name":"Bubble Magus Wp2000 Reactor Pump","price":"₹3950.00","category":"AQUARIUM PUMP & WAVE MAKER","image":"Bubble-Magus-opvoerpomp-WP4000 (1).jpg","description":"\nBubble Magus lifting pump 2000 – 2100 liters per hour. Maximum head height 2.2 m.\n"},"30":{"No":"30","product_name":"Calcion Calcium buffer – 2ltr","price":"₹4175.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"calcion-1-598x598.jpg","description":"\nBrightwell Aquatics Calcion Liquid Calcium 67.6oz 2L Highly-concentrated ionic calcium solution. Increases the concentration of calcium in marine aquarium water to provide corals and other reef-building invertebrates with one of the most important elements required for growth. Is ionic rather than chelated, and contains no unwanted organic material such as EDTA, gluconate, or polygluconate. Over 50% stronger than most competing products. Free of phosphate, silicate, and organic material. Formulated by a marine scientist.\n"},"31":{"No":"31","product_name":"Caribsea Arag-Alive Fiji Pink Sand","price":"₹1950.00","category":"MEDIA & SANDS","image":"Caribsea-1-598x598.jpg","description":"\nCaribsea Arag-Alive Fiji Pink Sand – 10lbs, 20lbs.\nYou can now bring the world’s most exotic reefs into your home with CaribSea Arag-Alive! substrates. Eight environmentally accurate echoscopes, developed from CaribSea cooperation with public aquariums and zoological parks where authenticity is a must, Arag-Alive! makes any aquarium uniquely yours. Arag-Alive! makes it easy to set up an aquarium. It’s ready to work, clears quickly and contains millions of live bacteria to cycle super fast and create a natural biological balance. Arag-Alive! suppresses the dreaded “new tank syndrome”, compresses the ammonia cycle and discourages nuisance algae. In fact, independent labs prove Arag-Alive! cycles days faster than other brands of live sand. That’s what makes Arag-Alive! the choice of new aquarists and maintenance companies where speed of set up, beauty and reliability are demanded.\n"},"32":{"No":"32","product_name":"CaribSea Arag-Alive Special Grade Reef Sand","price":"₹1950.00","category":"MEDIA & SANDS","image":"46f4218b-b8a1-4ffa-81c4-aa180c2dc85d_1.f19af6af5e3695e41aba85ded0392791-598x598.jpeg","description":"\nYou can now bring the world’s most exotic reefs into your home with CaribSea’s Arag-Alive substrates. It is developed from CaribSea’s cooperation with public aquariums and zoological parks, where authenticity is a must. Arag-Alive helps maintain a proper pH for the life of your aquarium without the constant addition of chemicals, and creates a biological balance to discourage nuisance algae. Arag-Alive contains millions of bacteria per pound specially engineered for aggressive waste reduction in closed systems like your aquarium. Arag-Alive is engineered to suppress œnew tank syndrome\u009d and compress the ammonia cycle. It begins to cycle your aquarium instantly. In fact, independent labs prove Arag-Alive cycles your aquarium days faster than other brands.\nCaribSea Arag-Alive Special Grade Reef Sand – 5kg, 10kg.\n"},"33":{"No":"33","product_name":"Chaeto GRO -500ml","price":"₹2450.00","category":"WATER FILTERATION & TREATMENT","image":"EDJKFJK.jpg","description":"\nNutrients are substances required by algae for survival; they are collectively involved in all aspects of the biological and chemical reactions that allow algae to function properly. Brightwell Aquatics ChaetoGro provides these substances in concentrations found by researchers to be necessary for long-term health. These elements, and some of the processes that they are involved in, are: Potassium – Protein synthesis, water and charge balance, enzyme activation. Boron – Chlorophyll production, flowering, root growth, cell function. Carbon – Required for all organic compounds. Calcium – Cell wall stability and permeability, enzyme activation, cell response to stimuli. Chlorine – Water and charge balance, photosynthesis. Iron – Required for photosynthesis, component of enzymes utilized in redox reactions. Magnesium – Component of chlorophyll, enzyme activation. Manganese – Formation of amino acids, enzyme activation. Molybdenum and Cobalt – Required for nitrate reduction. Nickel – Enzyme activation, processing of nitrogenous material. Sulfur – Component of proteins and the coenzymes that are involved with nutrient utilization and growth. Zinc – Chlorophyll production, enzyme activation. ChaetoGro does not contain phosphorus or nitrogen.\n"},"34":{"No":"34","product_name":"Clarifi-SW -250ml","price":"₹1095.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"618StLVQiL._SX522_.jpg","description":"\nFlocculant for improving water clarity in marine aquaria; helps eliminate cloudy water. Binds particulate material suspended in aquarium water, enabling removal from the system by means of mechanical filtration and protein skimming. Specifically formulated for use in marine aquaria; not to be used in freshwater aquaria. Safe for use with all manner of marine invertebrates, fishes, and macroalgae.\n"},"35":{"No":"35","product_name":"Coral Box Dca 12000 Pump","price":"₹12000.00","category":"AQUARIUM PUMP & WAVE MAKER","image":"image_show-598x598.jpg","description":"\nThe DC pumps are carefully inspected and tested to ensure both safety and operating performance. However, failure to follow the instructions and warnings in this manual may result in pump?s damage and\/or serious injury. Be sure to read and save this manual for future reference. Attention: Sensor is a replacement Kits, Not Include Warranty. Suggestion for 8 to 12 months to Change. Please Keep the sensor Clean and keep water level consistency. 1. High performance with innovational motor, and energy saving up to 50%, super quiet. 2. Suitable for both marine and fresh water, Rust free. 3. With anti-resistant ceramic shaft, last longer. 4. Auto Overflow Protection. 5. 10 \/ 30 \/ 50mins for feeding or change of water in aquarium use. 6. Water Lever Sensor – Overflow\/water shortage. 7. Wave mode, 0~10Voutput (only DCA4000\/6000\/9000\/12000)\n"},"36":{"No":"36","product_name":"Coral Box dca 2000 Pump","price":"₹4900.00","category":"AQUARIUM PUMP & WAVE MAKER","image":"DCA2000_3-scaled-598x598.jpg","description":"\nThe new Coral Box DCA pumps are the latest product in the affordable DC return pump revolution.\n"},"37":{"No":"37","product_name":"Coral Box Dca 9000 Pump","price":"₹10100.00","category":"AQUARIUM PUMP & WAVE MAKER","image":"Coral20Box20DCA20series2016-598x377.jpg","description":"\nIntroduction: The DC pumps are carefully inspected and tested to ensure both safety and operating performance. However, failure to follow the instructions and warnings in this manual may result in pump?s damage and\/or serious injury. Be sure to read and save this manual for future reference. Attention: Sensor is a replacement Kits, Not Include Warranty. Suggestion for 8 to 12 months to Change. Please Keep the sensor Clean and keep water level consistency. 1. High performance with innovational motor, and energy saving up to 50%, super quiet. 2. Suitable for both marine and fresh water, Rust free. 3. With anti-resistant ceramic shaft, last longer. 4. Auto Overflow Protection. 5. 10 \/ 30 \/ 50mins for feeding or change of water in aquarium use. 6. Water Lever Sensor – Overflow\/water shortage. 7. Wave mode, 0~10Voutput (only DCA4000\/6000\/9000\/12000)\n"},"38":{"No":"38","product_name":"Coral Fedding Pipette","price":"₹300.00","category":"ACCESSORIES","image":"41IQgZ7gSeL._AC_SX679_-598x428.jpg","description":"\nmake it easy to target feed liquid phytoplankton to corals or other invertebrates and aquatic animals,quick to clean your aquarium and change water without wet your hand, Convenient to control and allows you to directly feed your sea squirt, filter feeders and timid fish with ease and comfort\n"},"39":{"No":"39","product_name":"Coralline acceleration -250ML","price":"₹1875.00","category":"WATER FILTERATION & TREATMENT","image":"cora-598x598.jpg","description":"\nBrightwell cora -250ml\n"},"40":{"No":"40","product_name":"Cove coral Lens","price":"₹3200.00","category":"ACCESSORIES","image":"cove-lens-598x598.jpg","description":"\nCove coral Lens\n"},"41":{"No":"41","product_name":"Cove Skimmers","price":"₹23500.00","category":"PROTEIN SKIMMER","image":"FHEGJHGFG.jpg","description":"\nL-130\nMarine and Reef Tanks Tiny Footprint and Maximum Performance Completely Disassembles for cleaning German Made Aquabee Pump with superior Warranty Completely Water Tested Then Polished and Boxed for Retail Heavy Load: 75 Gallons \/ 300 litres Medium Load: 90 Gallons \/ 360 litres Light Load: 120 Gallons \/ 360 litres\nL-160\nMarine and Reef Tanks DC Controlled Protein Skimmer Tiny Footprint and Maximum Performance Completely Disassembles for cleaning German Made Aquabee Pump with superior Warranty Completely Water Tested Then Polished and Boxed for Retail Heavy Load: 150 Gallons \/ 600 litres Medium Load: 200 Gallons \/ 800 litres Light Load: 320 Gallons \/1280 litres\nL-200\nMarine and Reef Tanks DC Controlled Protein Skimmer Tiny Footprint and Maximum Performance Completely Disassembles for cleaning German Made Aquabee Pump with superior Warranty Completely Water Tested Then Polished and Boxed for Retail Heavy Load: 200 Gallons \/ 800 litres Medium Load: 300 Gallons \/ 1200 litres Light Load: 420 Gallons \/ 1680 litres\nCove Skimmers – L-130, L-160, L-200.\n"},"42":{"No":"42","product_name":"Coveone Cr150 Dua Chamberl Self Dosing Calcium Reactor","price":"₹59500.00","category":"MEDIA REACTORS","image":"efjefjkewjfklejf-598x598.jpg","description":"\nThe CR 150 lime reactor is designed for aquariums from 750 to 1500 liters. The lime reactor can be operated internally as well as externally from the filter sump. Dimensions: L 315 mm x W 330 mm x H 610 mm Filling quantity of broken coral: 3-6 liters Filling quantity magnesium: 1-3 liters This powerful lime reactor is made of very high quality acrylic. The lime reactor is operated via a two-chamber system. The large main chamber is filled with broken coral and the smaller side chamber with magnesium granulate. The two chambers can be very easily accessed through the large openings at the top be loaded. All components can be cleaned on the lime reactor be dismantled. The CR150 is equipped with a bubble counter and gas recirculation. Scope of delivery: ? lime reactor ? aquabee UP 2000 (230V, 50 Hz, 15 watts) ? various hoses ? spare screws ? bubble counter ? two stopcocks\n"},"43":{"No":"43","product_name":"cuprion -60ml","price":"₹1050.00","category":"WATER FILTERATION & TREATMENT","image":"91kFiMtfLZL.jpg","description":"\nFor use by experienced, qualified professional aquarists only. Ionic, non-chelated copper solution. 1 drop per gallon of water increases free copper concentration by ~0.20 ppm. For use in fish-only aquaria. Not for use with scaleless fish. Not for use in aquaria housing live plants or invertebrates. Consult an appropriate reference source for the use of ionic copper solutions in aquaria before use.\n"},"44":{"No":"44","product_name":"D-D Aqua Jumpguard Pro","price":"₹3250.00","category":"ACCESSORIES","image":"d-d-jumpguard.jpg","description":"\n\n\nThere is nothing worse than coming down in the morning to finding your favourite fish lying dead and crispy on the carpet. Many fish, especially wrasse, have a tendency to jump from the tank when frightened or chased by another fish and so a solution to preventing the loss of such fish should be high on every fish keepers priority list. D-D Jumpguard covers are a very lightweight, sleek, low visual impact and easy to construct screen cover suitable for most aquarium types, specifically designed to prevent fish loss due to jumping whilst maintaining high light penetration. The special extruded aluminium profile is now shaped with a lip which sits directly onto the edge of the glass, removing the requirement for any additional clips or brackets. The section is extruded then powder coated in a tough, low sheen, black finish for greater scratch resistance and greater aesthetics. The lower section of the corners is specifically designed so that it does not interfere with the silicone bead in the corners of your tank which gives a tight fit to the glass with no gaps. It also makes it easier and neater to cut off the corner if you want to bring wires out at the back of the tank for pumps and heaters. For those concerned with loss of light penetration into your reef tanks, we tested light levels with a Apogee MQ-200 meter and got the following results: PAR without cover around 390 – 400 PAR with cover around 380 – 390 Approximately a 2.5% reduction in light with no shadowing at all.\nD-D Aqua Jumpguard Pro – 75×75, 120×75, 180×90.\n\n\n"},"45":{"No":"45","product_name":"Dual Nozzel Lock Line","price":"₹650.00","category":"ACCESSORIES","image":"61b-JFDxhRL._AC_SL1500_-598x459.jpg","description":"\nnozzel for aqurium\n"},"46":{"No":"46","product_name":"Filter Socks 200 Micron","price":"₹250.00","category":"WATER FILTERATION & TREATMENT","image":"511ou-jarL._SX342_.jpg","description":""},"47":{"No":"47","product_name":"Flipper Deepsea Max Magnifer","price":"₹4455.00","category":"CLEANING TOOLS","image":"max-598x598.jpg","description":"\nFL!PPER Aquarium Product’s DeepSee MAX MAGNIFIED Magnetic Aquarium Viewer – 5″ * Optical grade magnifying lens with 5″ viewing portal is perfect for aquarium photography with focal range approximately 6 to 12 inches. * Held in place by strong rare earth magnets for use on tanks up to 3\/4″ (20mm) tank wall thickness * Easily moves around the tank for viewing from any location * Great at checking for any early signs of disease or pests on your reef coral or fish! * Designed for Larger tanks * DeepSee is Safe for both glass and acrylic!\n \n \n"},"48":{"No":"48","product_name":"Flipper Deepsea Standard Magnifier","price":"₹2950.00","category":"CLEANING TOOLS","image":"standard-598x598.jpg","description":"\n\nOptical grade magnifying lens with 4″ viewing portal is perfect for aquarium photography with focal range approximately 3 to 8 inches.\nHeld in place by strong rare earth magnets for use on tanks up to 5\/8″ (16mm) tank wall thickness\nEasily moves around the tank for viewing from any location\nGreat at checking for any early signs of disease or pests on your reef coral  or fish!\nDeep See is Safe for both glass and acrylic aquariums!\n\n"},"49":{"No":"49","product_name":"Flipper Max Replacement Blades","price":"₹1375.00","category":"CLEANING TOOLS","image":"efidjhewifh.jpg","description":"\nFL!PPER make replacement blade\n"},"50":{"No":"50","product_name":"Flipper Max-Flt Glass Cleaner Up To 20Mm","price":"₹6545.00","category":"CLEANING TOOLS","image":"81rw7QdGYaL.jpg","description":"\nFor Glass and Acrylic Tanks Up to 3\/4″ (19mm) Thickness Scrub, Flip, Scrape, and Now *FLOAT* with the patented FL!PPER Aquarium Cleaner. The new Floating FL!PPER is the last aquarium cleaning tool you will ever need! Flipper’s patented design creates the only 2 in 1 magnetic aquarium cleaner that can FLIP from scrubber to scraper simply by rotating the handle. Floating FL!PPER features an ergonomic GRIP\/FLIP handle for easy FL!PPING. The cleaner now floats to the top of your aquarium if it ever becomes disconnected for even easier retrieval! A “must-have” cleaning tool for advanced hobbyists and maintenance professionals! Flipper MAX Float Features – FLOATS to the surface if the cleaner ever becomes disconnected! – NEW Ergonomic GRIP\/FLIP Handle for easy FL!PPING from Scrubber to Scraper – NEW Improved longer lasting handle pad surface * Made with rare earth magnets for incredible cleaning strength and durability. Cleans even the most stubborn coralline algae * Blade side has only 3 contact points resulting in a safety gap between the cleaner and the glass. This minimizes the chance of trapped sand which reduces the chance of scratching, even when cleaning below the sand! * Unique orienting buoyancy always keeps the magnets facing the glass for easy retrieval * Includes (2) replaceable blades: Stainless Steel for glass tanks and ABS plastic for acrylic tanks. Recommended to replace blades every 3-6 months to maintain optimal algae scraping * Designed for Glass and Acrylic Tanks Up to 3\/4″ (19mm) Thickness\n"},"51":{"No":"51","product_name":"Flipper Nano -Flt Glass Cleaner","price":"₹1850.00","category":"CLEANING TOOLS","image":"edfjiodiof.jpg","description":"\nThe new Flipper Float is the ultimate tool for keeping your aquarium glass free of unsightly algae! Flipper’s patented design creates the only 2 in 1 magnetic aquarium cleaner that can quickly flip from scrubber to scraper simply by rotating the handle. Flipper magnet cleaners feature a low-profile wet side and strong neodymium magnets so you can scrub or scrape away even tough algae buildup without ever having to stick your hands in the water.\n"},"52":{"No":"52","product_name":"Flipper Platinium Steel Scrapper Blade","price":"₹685.00","category":"CLEANING TOOLS","image":"800x-598x897.jpg","description":"\nFL!PPER Platinum Credit Card Aquarium Algae Scraper – 18″\n"},"53":{"No":"53","product_name":"Flipper Platinum Scraper","price":"₹1550.00","category":"CLEANING TOOLS","image":"HJHHRJ.jpg","description":"\nFL!PPER Platinum Credit Card Aquarium Algae Scraper – 18, 28 inch\n"},"54":{"No":"54","product_name":"Flipper Standard Replacement Blades","price":"₹1050.00","category":"CLEANING TOOLS","image":"51aqOWOXycL._AC_SX425_.jpg","description":"\nFL!PPER standard replacement blade\n"},"55":{"No":"55","product_name":"Flipper Standard-Flt Glass Cleaner Upto 12Mm","price":"₹3685.00","category":"CLEANING TOOLS","image":"61Ytv97U9L._SL1000_-598x598.jpg","description":"\nFL!PPER Flipper Cleaner Float – 2-in-1 Floating Magnetic Aquarium Glass Cleaner – Fish Tank Algae Cleaner – Scrubber & Scraper Aquarium Cleaning Tools ?“ Floating Fish Tank Cleaner, Standard\n"},"56":{"No":"56","product_name":"Fritz RPM Redline High Alkalinity Complete Marine Salt (25Kg)","price":"₹6200.00","category":"ACCESSORIES","image":"Fritz-RPM-Redline-High-Alkalinity-Complete-Marine-Salt-550x550w.png","description":"\nSame Great Benefits as RPM’s Original Formula Plus higher alkalinity for increased SPS growth in higher nutrient aquariums!\n\nComplete Professional Marine Salt Mix for Reef or Fish Only Systems\nContains All Essential Major, Minor & Trace Elements\nEnhanced Alkalinity Levels\nNitrate, Phosphate & Ammonia Free\n\nAbout Fritz RPM Redline – High Alkalinity Complete Marine Salt\nFritz Reef Pro Mix (RPM) High Alkalinity Formula is manufactured using only the highest quality raw materials. RPM High Alkalinity Formula contains all of the necessary major and minor elements of natural sea water that are utilized by living marine and reef animals along with enhanced alkalinity. Increased alkalinity has been shown to increase the growth of SPS. Fritz Reef Pro Mix High Alkalinity Formula Salt is manufactured in our own facility in small batches to ensure complete quality control, rather than outsourced to generic chemical blender with uncertain quality standards. Our salt blending equipment id devoted solely to the production of marine salt blends, preventing contamination issues. Fritz’s unique production process salts. Each batch is assigned a lot number and tested by in-house quality control to ensure its chemical quality, purity and consistency before it is shipped. RPM is used by public aquariums, zoos, research institution, destination retail locations and hobbyists worldwide\nParameters*\nSalinity 35 ppt\nCalcium 400-450 ppm\nMagnesium 1300-1400 ppm\nAlkalinity 10 – 11.5dkh\nStrontium 9 ppm\nPotassium 400 ppm\n*Parameters reflect Fritz Aquatics’ QC pass ranges, the median is targeted. Be aware source water can greatly affect parameters, especially alkalinity. QC is conducted using RO\/DI at a neutral pH and a TDS of 0.\nDirections & Dosage\nMIXING DIRECTIONS\nFor best results, it is important to follow proper mixing instructions when using salt with elevated parameters like Fritz Aquatics Reef Pro Mix. See below for best practices when using RPM.\nWhen mixing Fritz Reef Pro Mix, it is best to use RO\/DI water quality checked by a TDS meter (TDS should be less than 10 ppm, 0 is preferred). Fill a clean mixing container (dedicated to saltwater mixing only) with desired amount of water to be prepared. For best results, use water between 70°-75°F (21°-24°C) when mixing RPM. Slowly add desired amount of RPM to the water to avoid an increase in temperature and precipitation. This helps to prevent precipitation of calcium, alkalinity and other elements. It is recommended to use a mixing pump and an airstone when mixing RPM. This will also help to avoid concentrated areas of material and precipitation. Using a properly calibrated refractometer, bring the water to the desired salinity. Once mixed to a clear solution, add a heater to the water to bring to the current temperature of your aquarium. It is recommended to allow two hours before performing a water change. If water does not mix clear, please contact us for further mixing tips before performing a water change.\nDO NOT MIX DRY SALT DIRECTLY INTO SYSTEMS WITH LIVESTOCK PRESENT!\nCAUTION: Keep out of reach of children. Not for human consumption. Generates slight heat when added to water; avoid handling with wet hands. Contact with dry powder may cause skin and\/or eye irritation. In case of contact, flush eyes with cool water and seek immediate medical attention.\nStorage: Store in a cool, dry place. Keep product tightly sealed.\n"},"57":{"No":"57","product_name":"Funa Marine  Balling Trace Elements  2 -500Ml","price":"₹2100.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"140A_2-598x598.png","description":"\nFauna Marin Balling Trace 1 500ml Micro and trace elements serve as an equilibrium solution for the Balling Light and Classic method. The addition of trace elements to the Balling salts represents a complete system\n"},"58":{"No":"58","product_name":"Funa Marine  Balling Trace Elements  3 -500Ml","price":"₹2100.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"140A_2-598x598 (1).png","description":"\nFauna Marin Balling Trace 1 500ml Micro and trace elements serve as an equilibrium solution for the Balling Light and Classic method. The addition of trace elements to the Balling salts represents a complete system\n"},"59":{"No":"59","product_name":"Funa Marine  Color Element Blue Purple Complex-500Ml","price":"₹2450.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"fauna_marin_color_elements_blue_purple_complex_250ml_835_1_20191113112421-598x449.jpg","description":"\nThese Elements are a novel mix of growth and color enhancing trace elements, based on a unique and experimentally confirmed receipe which perfectly adopts to modern artifical seasalt mixes. Developed by leading scientists, this state- of-the-art element mixaligns the micronutrient consumption of tropical corals with the environmental light conditions generated by LED lighting systems. It allows for stable conditions in the micronutrient budget in coral reef aquaria, and thereby significantly increases coral growth rates and coral coloration. Due to the special formulation of the elements this mix does not lead to the accumulation of excess toxic trace metals in the aquarium and effectively prevents the growth of unwanted algae. Passend\/suitable zu\/to Balling Light System or other Systems based on Zeolith or Pellet filtration. Advantages supplements grow active Elements and increase the calcification rates increase coral tissue grow and coloration of SPS and LPS Corals improve the flourescent effect provide the coral against radiation stress effective concentrate (50% less consumption)\n"},"60":{"No":"60","product_name":"Funa Marine Bacto Reef Ball Bio Bactaria -250 Ml","price":"₹3100.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"200019-598x598.png","description":"\nMillions of live reef-bacteria and enzymes in depot balls for easy dosing. BACTO REEF BALLS EFFECT: Crystal clear & healthy water, nutritioncontrol and easy reduction of ammonia, nitrite, nitrate and phosphates. Cleans up organic waste and unwanted detritus, raises up skimming, reduces fi lter maintenance and eliminates unwanted bacteria and algeas. Easy dosing ? with the unique and long lasting depot effect. CONTENT: Millions of live natural marine bacteria in depotballs for marine aquaria. Bacto Reef Balls 100ml contains ca 110 spheres, each ca. 1cm average diameter. DOSING: 2 Reef Balls \/ 100 Liters (26,4 US Gal) \/ every 2 weeks directly in your filter. Avoid that balls soak into pumps. Reef Balls are made from a biodegradable polymer. Variations in size and rates are normal. SAFETY INSTRUCTIONS: For use in Reefaquaria only, not meant for human consumption. Keep out of reach of children and animals. Wash your hands after use.\n"},"61":{"No":"61","product_name":"Funa Marine Batco Reef Blend-500Ml","price":"₹3550.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"141BactoBlend-598x598.png","description":"\nACTO BLEND: our all-rounder! Super concentrated mixture of halophilic and phototrophic bacteria Perfect bacterial mixture for starting a salt water aquarium Contains hydrolytic enzymes and special nitrogen bacteria for reduction of unwanted nutrients Reduces sludge and detritus build-up; highly effective against unwanted bacterial deposits Improves growth and coloration of fish and corals Fresh ocean smell \/ improves skimmer performance Contains NO sulfide or other toxic preservatives No foul odor or rotten egg smell Live bacteria \/ effect immediately after dosing Highly concentrated for cost-effective dosing Developed and produced in Germany\n"},"62":{"No":"62","product_name":"Funa Marine batco Reef Therapy Super-500Ml","price":"₹3550.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"FM_Bacto20Therapy20500_v2-598x897.png","description":"\nFauna Marin Bacto Therapy is the perfect blend of halophilic and probiotic bacterial cultures, removes waste products from fish food. Bacto Therapy also helps in the breakdown of organic organic deposits and accumulate detritus. In addition, Fauna Marin Bacto Therapy reduces the long-term build-up of organic waste and the number of pathogens is also reduced to a minimum risk for fish and coral diseases.\n"},"63":{"No":"63","product_name":"Funa Marine Color Elements Green Purple Complex -500Ml","price":"₹2450.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"rfgjnirfhur-598x519.jpg","description":"\nThese Elements are a novel mix of growth and color enhancing trace elements, based on a unique and experimentally confirmed receipe which perfectly adopts to modern artifical seasalt mixes. Developed by leading scientists, this state- of-the-art element mixaligns the micronutrient consumption of tropical corals with the environmental light conditions generated by LED lighting systems. It allows for stable conditions in the micronutrient budget in coral reef aquaria, and thereby significantly increases coral growth rates and coral coloration. Due to the special formulation of the elements this mix does not lead to the accumulation of excess toxic trace metals in the aquarium and effectively prevents the growth of unwanted algae. Passend\/suitable zu\/to Balling Light System or other Systems based on Zeolith or Pellet filtration. Advantages supplements grow active Elements and increase the calcification rates increase coral tissue grow and coloration of SPS and LPS Corals improve the flourescent effect provide the coral against radiation stress effective concentrate (50% less consumption)\n"},"64":{"No":"64","product_name":"Funa Marine Color Elements Red Purple Complex-500Ml","price":"₹2450.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"jfgioerhuhe-598x545.jpg","description":"\nThese Elements are a novel mix of growth and color enhancing trace elements, based on a unique and experimentally confirmed receipe which perfectly adopts to modern artifical seasalt mixes. Developed by leading scientists, this state- of-the-art element mixaligns the micronutrient consumption of tropical corals with the environmental light conditions generated by LED lighting systems. It allows for stable conditions in the micronutrient budget in coral reef aquaria, and thereby significantly increases coral growth rates and coral coloration. Due to the special formulation of the elements this mix does not lead to the accumulation of excess toxic trace metals in the aquarium and effectively prevents the growth of unwanted algae. Passend\/suitable zu\/to Balling Light System or other Systems based on Zeolith or Pellet filtration. Advantages supplements grow active Elements and increase the calcification rates increase coral tissue grow and coloration of SPS and LPS Corals improve the flourescent effect provide the coral against radiation stress effective concentrate (50% less consumption)\n"},"65":{"No":"65","product_name":"Funa Marine Coloure Complex Set Of 3 500-Ml","price":"₹7350.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"fm-blue-color-1-ink.jpeg","description":"\nFauna Marin Balling Trace 1 500ml Micro and trace elements serve as an equilibrium solution for the Balling Light and Classic method. The addition of trace elements to the Balling salts represents a complete \n"},"66":{"No":"66","product_name":"Funa Marine Elements K-1000Ml","price":"₹2250.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"14110-598x598.png","description":"\nEssential concentrated pottasiummix?supplement for?marine aquaria\n"},"67":{"No":"67","product_name":"Funna Marine Balling Trace Elements 1-500Ml","price":"₹2100.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"140A_2-598x598 (2).png","description":"\nFauna Marin Balling Trace 1 500ml Micro and trace elements serve as an equilibrium solution for the Balling Light and Classic method. The addition of trace elements to the Balling salts represents a complete system\n"},"68":{"No":"68","product_name":"Fx stp Spare Pipes","price":"₹475.00","category":"ACCESSORIES","image":"211675-kamoer-fx-stp-peristaltic-pump-tubeassembly-acc-598x598.jpg","description":"\nspare pipes for kamoer fx stp pump\n"},"69":{"No":"69","product_name":"FX Stp Spare Roller","price":"₹750.00","category":"ACCESSORIES","image":"211674-kamoer-fx-stp-peristaltic-pumphead-pump-an-598x598.jpg","description":"\nspare roller for kamoer fxstp\n"},"70":{"No":"70","product_name":"Guo elephant Super glue","price":"₹890.00","category":"ACCESSORIES","image":"13febc754dd120e5f476aab7e8f52c3e-598x598.jpg","description":"\nGuo elephant Super glue Instant adhesive Water grass glue Moss coral sinking stone Aquarium special glue Landscaping supplies\nInstant adhesive\nProduct description: Good quality, good results, hot products.\n"},"71":{"No":"71","product_name":"H2 Ocean Fluidised Media Reactor","price":"₹5400.00","category":"MEDIA REACTORS","image":"guygygyg.jpg","description":"\nThe FMR75 Fluidised Reactor has been developed by D-D to give the ultimate low cost solution for fluidising a whole range of materials that are used on your marine or freshwater aquarium\nH2 Ocean FMR75 Without Pump\n"},"72":{"No":"72","product_name":"Jebao Dcp 15000  Pump","price":"₹17400.00","category":"AQUARIUM PUMP & WAVE MAKER","image":"JDAKHKJ-598x599.jpg","description":"\nJebao 2017 new DCP pumps give you enhanced performance and precise control of flow through your aquarium’s reactors, sump, or closed loop system. With complete control through the DCP Controller, you can control the flow of the pump, enter feed modes (10 minutes), Motor Protection if rotor is blocked.\n"},"73":{"No":"73","product_name":"Jebao Dp 2.4 Dosing Pump","price":"₹9600.00","category":"DOSING PUMP & AUTOMATION","image":"UHBYUUGF.jpg","description":"\njecod \/ Jebao Doser 2.4 is a precise, automatic liquid dispenser, designed especially for aquarium needs. Thanks to this device, you can easily and conveniently solve the issue of regular feeding of fertilizers and salt to the aquarium without the need to constantly remember about this important activity. A wide range of available settings allows you to adjust the operation of Doser 2.4 to any tank.\n"},"74":{"No":"74","product_name":"Jebao Dp4 Dosing Pump","price":"₹7480.00","category":"DOSING PUMP & AUTOMATION","image":"139406a9-abc2-4bc9-98b8-34e995379aa3__05800.1634920833-598x598.jpg","description":"\nThe DP-4 is a new, affordable dosing pump with 4 dosing heads. You can program each pump to come on up to 24 times a day and dispense a precise amount of solution, which allows a user to keep their tank parameters stable, and removes the need for mixing supplements daily. The controller is easy to use and advanced, and each pump can be programmed individually. The DP-4 is perfect for any tank, as it allows for dosing in both large and small increments. The DP-4 comes with a power supply and is plug and play after it is calibrated with a 100mL graduated cylinder or measuring cup (not included)\n"},"75":{"No":"75","product_name":"Kalk+2","price":"₹1050.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"ljkjt-598x598.jpg","description":"\nKalk+2 – 100g \/ 225g.\nCalcium, magnesium, and strontium are required for the formation of aragonite, the skeletal material of reef-building invertebrates such as corals, clams, tube worms, and their respective allies. Brightwell Aquatics Kalk+2 provides these elements and may also be used to help regulate pH in reef aquaria. Kalk+2 does not contain chloride salts, which is a strong point for some hobbyists\n"},"76":{"No":"76","product_name":"Kamoer Ato One 2","price":"₹4850.00","category":"DOSING PUMP & AUTOMATION","image":"1-kamoer-ato-one.jpg","description":"\nATO One 2 SE is the standard version with submersible pump, it only needs to install the sensor and submersible pump, which can be used after power on without setting. The sensor is fixed by magnet, which is convenient for installation and adjustment. Equipped with optical level sensor, blue optical level sensor is used to monitor the water level and decide whether to replenish water, red optical level sensor is used to prevent the overflow. ATO One 2 SE has rich status indication, when the refill water overflows or overtime, when the water in the refill container is insufficient, ATO One 2 SE will have indicator light and buzzer alarm.\n"},"77":{"No":"77","product_name":"Kamoer Fx-Stp 2 Wifi Pump For Calcium Reactors","price":"₹17500.00","category":"DOSING PUMP & AUTOMATION","image":"DOKA-FX-STP-Box-598x598.jpg","description":"\nDosing Pump for Countinuous Use The Kamoer FX-STP is ideal for applications that require continuous dosing of liquids like gradual water changes, sulfur de-nitrators and even a hassle-free solution for using a calcium reactor. Kamoer specifically designed the FX-STP for continuous liquid dosing in aquariums. The FX-STP pump features a compact size and quiet operation. What sets this pump apart from others is the ability to adjust the flow while running. Using the FX-STP to feed a calcium reactor is the best method we know that provides reliable and stable long term effluent flow. It allows us to easily overcome any inconsistencies and set the reactor?s effluent with enough pressure, reliable, and predicable metered rate. Suitable for Continuous Dosing Suitable for countinous dosing applications Ideal feed for calcium reactors Quiet operation High precision stepper motor driver Adjustable flow rate setting of 1 to 120ml\/min Easy to calibrate Memory back up – user setting saved if power lost Easy to replace long life PharMed tubing Dimensions -5in (h) x 3?in (w) x 5?in (d)\n"},"78":{"No":"78","product_name":"Kamoer X1 Bluetooth Micropump","price":"₹4100.00","category":"DOSING PUMP & AUTOMATION","image":"41gIutsWCPL._SS400_.jpg","description":"\nKamoer X1 Bluetooth Micropump –\nAdd multiple X1 pumps to control\nDaisy chain up to Four -X1 pumps per power supply Flow calibration setting\nOperational modes (Manual, Auto Quick Setting)\nEasy setting – Set dosing start and stop time (does not have to be 24 hours)\nEnter total number of ml to be dosed over the time period\nEnter the number of times to dose each time period (up to 12 times)\nUser can even choose dosing every 1 – 31 days or certain days per week\nAdjustable dosing volume Auto Mode: 1 – 6500.0ml\nAdjustable dosing volume Manual Mode (Manual Mode ONLY): 0.5 – 6000.0ml\nDelay setting between channels prevents chemical interference\n"},"79":{"No":"79","product_name":"KAMOER X1 PRO T","price":"₹9940.00","category":"STEPPER PUMP","image":"41tOrCOgXEL._SY355_-1.jpg","description":"\nhe X1 PRO T is a single-channel micropump equipped with a reliable stepper motor that your mobile App can remotely control. Ideal for calcium reactors, denitrators, gradual water changes, or any other fluid that you need to transfer to your aquarium continuously. The Kamoer X1PRO-T is both compact and quiet, but the most significant feature is changing the flow rate while it is running. You can vary the flow anywhere from1mL\/min to 70mL\/min, depending on your application. X1 PRO T uses a high-quality plastic noncorrosive geared pump, which will not slip or rust. In addition, the X1 Pro T is exceptionally reliable and includes threaded connectors to ensure that there will be no leakage when joined to dose lines.\n"},"80":{"No":"80","product_name":"Kamoer X2S Auto  Water Changing System","price":"₹23150.00","category":"DOSING PUMP & AUTOMATION","image":"Kamoer-X2S-500px.png","description":"\nThe X2S is a twin head, App controlled, WIFI water change pump, designed to automate regular water changes on your aquarium system. One pump removes water and the other one replaces it by the same volume automatically.?\n"},"81":{"No":"81","product_name":"Kamoer X4 Pro Dosing Pump","price":"₹23500.00","category":"DOSING PUMP & AUTOMATION","image":"kamoer-4-598x598.jpg","description":"\nThe new Kamoer F4 PRO Wifi Doser Liquid Dosing Pump is the latest state of the art controllable dosing system from Kamoer. Each unit includes a Wifi connection which allows the doser to be controlled via iPhone or Android.\n"},"82":{"No":"82","product_name":"koral – MD CORAL cleaner-250ml","price":"₹950.00","category":"WATER FILTERATION & TREATMENT","image":"koral-md-250ml.jpg","description":"\nKoral MD Coral Dip does not contain iodine. It is an all natural prophylactic cleaner, dip and conditioner, made from natural plant extracts and oils, for use in cleaning new corals, live rock, and empty coral fragging & holding facilities. It will assist in cleaning corals prior to addition into the aquarium. It will also prevent the transfer of unwanted substances into the aquarium. It will assist in acclimating newly fragmented corals and washing new or damaged corals. It is safe for dipping stony and soft corals, sea anemones, mushroom anemones and zoanthids. It is excellent to use to wipe down or to soak holding facilities or old aquariums for reuse (rinse well after use). This product is not a medication or a household cleaner.\n"},"83":{"No":"83","product_name":"Kz Acro Glow 50 Ml","price":"₹3700.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"AcroGlow.jpg","description":"\nAcroGlow promotes recovery and very good coloration especially of Acropra Sp.\n"},"84":{"No":"84","product_name":"magnesion – 2ltr","price":"₹3290.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"91kFiMtfLZL-1.jpg","description":"\n\n\n\n\nMagnesium plays a vital role in reef aquaria: it helps maintain calcium and carbonate (composing the majority of measurable alkalinity) concentrations by limiting unwanted inorganic precipitation with each other. In the absence of adequate magnesium ions, calcium and carbonate ions bond rapidly, depleting their concentrations in the system and creating the false impression that heavier supplementation is required to re-establish the desired concentrations. No matter how much calcium is added, its natural seawater concentration of 412 ppm will never be sustained until the magnesium concentration begins to approach 1, 290 ppm. Once the balance between calcium and magnesium has been established, subsequent calcium supplementation yields immediate positive results. Keeping magnesium within a range of 1, 290-1, 320 ppm will maintain the desired balance, and provides enough of the element to reef-building organisms for the formation of aragonite ( 0. 10% Mg by weight). The rate at which magnesium is extracted from the water is determined by the stocking density of reef-building livestock, type of lighting, and other conditions; therefore, each aquarium will have different requirements for the rate of magnesium supplementation. Once the rate of magnesium uptake in the aquarium has been determined, the proper dosing rate of this product can be easily calculated. It is recommended that a quality salt mix with the proper (not augmented) alkalinity and concentrations of major, minor, and trace elements be used to establish natural seawater parameters in the reef aquarium, providing a stable ionic foundation on which to build.\n\n\n\n\n\n\n\nImportant information\n\nBasic: Shake product well before using. Add 5 ml (1 capful) of product per 20 US-gallons of aquarium water every other day or as needed to maintain the magnesium concentration within a range of 1,290 – 1,320 ppm. When used in this fashion, 250 ml treats up to 1,000 US-gallons (3,785 L). Advanced: Determine the magnesium concentration in the aquarium using an accurate test kit before supplementing. Shake this product well before using. Each ml of Magnesion will increase the concentration of magnesium (“[Mg2+]”) in 1 US-gallon (3.785 L) of water by 26 ppm. If the initial [Mg2+] in the aquarium is below 1,288 ppm, add this product at the maximum rate of 10 ml per 20 US-gallons daily until the desired concentration is attained, then dose daily or weekly as needed (see below). Always try to maintain the [Mg2+] within a range of +\/-10 ppm. To determine the dosing rate of this product once the desired [Mg2+] has been acquired, measure the daily rate of magnesium uptake (i.e. the decrease in magnesium) in your aquarium by measuring the aquarium’s [Mg2+] at the same time each day over a one- to two-week period. To determine the daily dosing rate (preferable to weekly dosing) for magnesium maintenance: estimate the volume of water in the entire aquarium system; divide the daily decrease in [Mg2+] by 26; multiply this number by the volume of water in the system to get the daily dosage required (ml) to maintain a stable [Mg2+]. Daily dosing maintains a more stable [Mg2+] (and more natural environment) than dosing weekly, in which the [Mg2+] spikes just after dosing and then gradually decreases throughout the course of the week. Caution: Keep out of reach of children. Not for human consumption.\n\n\n\n"},"85":{"No":"85","product_name":"Mantis Bio-Filter Blocks","price":"₹1600.00","category":"WATER FILTERATION & TREATMENT","image":"bio-filter-blocks-598x598.jpg","description":"\nInert ceramic material with open flow architecture and largest use-able surface area. Higher efficiency relative to conventional media results requirements to achieve treat NH4-N and NO3-N. Most technically advanced bio-filtration media. The surface of the block is a microporous and has a large specific surface area. It is suitable for the growth of various microorganisms and forms a stable and highly active biofilm on its surface. The three-dimensional void (3D) formed by the sphere and the sphere produces a powerful bactericidal effect. They are a great base for sponge growth, micro-fauna, and even coral frags. Bio-Filter Block will work in sumps, trickle filters, wet\/dry filters, hang on the back filters or directly in the tank. Suitable for use in fresh, marine and pond water!\n"},"86":{"No":"86","product_name":"Mantis Bio-Filter Sphere 2Kg","price":"₹2350.00","category":"WATER FILTERATION & TREATMENT","image":"81IhcXuv7L._SY355_.jpg","description":"\nInert ceramic material with open-flow architecture and largest usable surface area Higher efficiency relative to conventional media, efficiently treating NH4-N and NO3-N. Most technically advanced bio-filtration substrate. 2kg box. The surface of the spheres is microporous and each Bio-Sphere has up to 54cm squ surface area for the establishment of bacterial colonies. It is suitable for the growth of various microorganisms and forms a stable and highly active bio-film on its surface. The three-dimensional void (3D) formed by the spheres produces a powerful bactericidal effect. They are a great base for sponge growth, micro-fauna and coral frags. Bio-Filter Sphere wil work in sumps, trickle filters, wet\/dry filters, hang-on filters or directly in the tank. It can be used in both fresh water and seawater environment.\n"},"87":{"No":"87","product_name":"mantis Coral Lens For Mobile Camera","price":"₹1150.00","category":"ACCESSORIES","image":"coral-lens-5.jpg","description":"\nBox Include: Lens Support Clip, Macro Lens 10x, Yellow Lens, Amber Lens & Lens Cloth.\n"},"88":{"No":"88","product_name":"Mantis Cyanoacrylate Aquaglue 25X4 Grams","price":"₹1450.00","category":"ACCESSORIES","image":"MANTISCYANOGLUE-598x598.jpg","description":"\nMantis Aqua Glue Pack – 25x 4g TubesMantis Aqua Glue is designed to glue coral fragments to plugs and rocks\n"},"89":{"No":"89","product_name":"Mantis RO-DI Unit","price":"₹13500.00","category":"DOSING PUMP & AUTOMATION","image":"mantis-ro-di-v-2-598x582.jpg","description":"\nRO-DI equipment with four stages, Sediment Filter, Carbon Cartridge. 400 l \/ d membrane and DI resin post-filter. Includes controller with display, automated car wash functions, pressure pump that ensures high performance of the equipment, online TDS measurement and support.\nFor the production of soft water with low-salt content for fresh and salt water aquaria, for spraying terrariums and many other applications.\nThe reverse osmosis system platinum line plus is a compact and versatile superior unit. It is supplied with three large 10″ filter housings. The filter cartridges (activated carbon, fine filter and demineralization resin) can easily be replaced. The supplied pressure gauge will display the operation pressure at any time. All components, the prefilter housings and the membrane module are mounted onto a stable powder-coated bracket. The unit has a high pressure pump and a flushing valve and therefore, can achieve a high ratio of pure to waste water output up to 1:1. The salt removal rate is up to 99%. Due to the fully automatic back flushing and continuous monitoring of the pure water, the unit requires very little maintenance.\n"},"90":{"No":"90","product_name":"Mantis Smart Ato","price":"₹4800.00","category":"DOSING PUMP & AUTOMATION","image":"mantis-smart-ato-598x598.jpg","description":"\nThe Smart ATO Micro is an automatic aquarium filler, reduced design. Its optical digital sensor controls the water level of the aquarium, actuating the included pump thus always maintaining a stable level in the aquarium with the rapid safety technology (QST) that provides in real time total and safe protection in the event of failure. Smart ATO Auto Filler Features: Small and compact Fast Safety Technology No moving parts Built-in magnetic holder Waterproof magnet Input: 100-240 VAC 50-60Hz DC Pump Head: 200 cm Flow rate: 280 l\/h Maximum wall thickness: 12.7 mm\n"},"91":{"No":"91","product_name":"Mantis Tornado Eco 10000  Pump","price":"₹11200.00","category":"AQUARIUM PUMP & WAVE MAKER","image":"bomba-tornado-mantis-1-598x598.jpg","description":"\nMantis Tornado Silent Water Bomb DC Perfect for marine facilities. Controller with digital screen and touch control. Constant flow mode of 20 levels Mode flow of pulse waves of 20 levels Transmission mode of slow increase and slowdown. Feeding mode. Totally safe 24 v DC with feeding source 110 v-220 vac, 50-60 Hz Warranty one year Protection System in case of lack of water or blocking of impeller.\n"},"92":{"No":"92","product_name":"Mantis Tornado Eco 12000 Pump","price":"₹12900.00","category":"AQUARIUM PUMP & WAVE MAKER","image":"40-598x598.jpg","description":"\nMantis Tornado Silent Water Bomb DC Perfect for marine facilities. Controller with digital screen and touch control. Constant flow mode of 20 levels Mode flow of pulse waves of 20 levels Transmission mode of slow increase and slowdown. Feeding mode. Totally safe 24 v DC with feeding source 110 v-220 vac, 50-60 Hz Warranty one year Protection System in case of lack of water or blocking of impeller.\n"},"93":{"No":"93","product_name":"Mantis Tornado Eco 2000  Pump","price":"₹5850.00","category":"AQUARIUM PUMP & WAVE MAKER","image":"431-263810237f9b9b596815926199631679-480-0.png","description":"\nMantis Tornado Silent Water Bomb DC Perfect for marine facilities. Controller with digital screen and touch control. Constant flow mode of 20 levels Mode flow of pulse waves of 20 levels Transmission mode of slow increase and slowdown. Feeding mode. Totally safe 24 v DC with feeding source 110 v-220 vac, 50-60 Hz Warranty one year Protection System in case of lack of water or blocking of impeller.\n"},"94":{"No":"94","product_name":"Mantis Tornado Eco 4000  Pump","price":"₹7800.00","category":"AQUARIUM PUMP & WAVE MAKER","image":"shdfifhgiudhiu.jpg","description":"\nMantis Tornado Silent Water Bomb DC Perfect for marine facilities. Controller with digital screen and touch control. Constant flow mode of 20 levels Mode flow of pulse waves of 20 levels Transmission mode of slow increase and slowdown. Feeding mode. Totally safe 24 v DC with feeding source 110 v-220 vac, 50-60 Hz Warranty one year Protection System in case of lack of water or blocking of impeller.\n"},"95":{"No":"95","product_name":"Mantis Tornado Eco 6000 Pump","price":"₹9250.00","category":"AQUARIUM PUMP & WAVE MAKER","image":"bomba-tornado-mantis-598x598.jpg","description":"\nMantis Tornado Silent Water Bomb DC Perfect for marine facilities. Controller with digital screen and touch control. Constant flow mode of 20 levels Mode flow of pulse waves of 20 levels Transmission mode of slow increase and slowdown. Feeding mode. Totally safe 24 v DC with feeding source 110 v-220 vac, 50-60 Hz Warranty one year Protection System in case of lack of water or blocking of impeller.\n"},"96":{"No":"96","product_name":"Mantis Tornado Skimmer","price":"₹11500.00","category":"PROTEIN SKIMMER","image":"FISHKEEPERSPRODUCT1000X1000-598x598.jpg","description":"\nImpressive performance remarkable small footprint distinctive turbulence reducing body solid Pvc and acrylic construction bubble dispersant chamber efficient & quiet operation disassembles complete for easy cleaning and maintenance in sump installation only\nMANTIS – 120. 150. 180. 200.\n"},"97":{"No":"97","product_name":"Mantis Tourbon Wave Maker Pump","price":"₹5150.00","category":"AQUARIUM PUMP & WAVE MAKER","image":"FFHHKDF.jpg","description":"\nThe Mantis Tourbon Pump 60 Wave maker Offers Powerful Wave-Making Performance At An Affordable price Point with 2 years warranty.\nThe Mantis Tourbon Pump 100 Wave maker Offers Powerful Wave-Making Performance At An Affordable price Point with 2 years warranty.\nThe Mantis Tourbon Pump 200 Wave maker Offers Powerful Wave-Making Performance At An Affordable price Point with 2 years warranty.\nMantis Tourbon Wave Maker Pump – 60, 100, 200WAVE MAKER\n"},"98":{"No":"98","product_name":"Marlin Cross Flow Wave Makers","price":"₹8950.00","category":"AQUARIUM PUMP & WAVE MAKER","image":"SDNFGJSDFGJSDGF.jpg","description":"\nMA – 100\nMarlin 10,000 Litre Per Hour Wave Pumps Recommended for tanks up to 1m 7 Different wave modes 2 Year Warranty\nMA – 200\nMarlin 20,000 Litre Per Hour Wave Pumps Recommended for tanks up to 1m 7 Different wave modes 2 Year Warranty\n"},"99":{"No":"99","product_name":"Md-02 Fish Acclimation Box Duel Convertible","price":"₹1750.00","category":"ACCESSORIES","image":"11980.jpg","description":"\nSea Side Aquatics nueva aclimataci?n\/caja de utilidad plegable viene en 4 diferentes tama?os RFC-100 (sm), RFC-200 (med), RFC-300 (lg), RFC-400 (xlg). Cada divisor de unidad se puede quitar (solo en cajas med-xlg) para crear una unidad grande. El soporte colgante ajustable puede soportar 3\/4 “panel de vidrio\/acr?lico y es compatible con el tanque sin llanta y euro reforzado. La caja de aclimataci?n\/utilidad puede ser completamente plegable para ahorrar espacio para un f?cil almacenamiento. Las cajas de aclimataci?n\/utilidad se pueden utilizar para: – aclimatar nuevos peces en su sistema – cuarentena peces finicky\/t?midos – ayudar a los peces payaso a hospedar anenoma – alimentador de peces peces \n"},"100":{"No":"100","product_name":"MicroBacter Clean","price":"₹1650.00","category":"WATER FILTERATION & TREATMENT","image":"91jj1DB3VxL-2.jpg","description":"\nThe concentration of dissolved and particulate organic materials in any aquatic environment can have a significant impact on the overall appearance of, as well as the health of organisms residing within that system. Relatively low-nutrient environments are characterized by high water clarity, lack of unpleasant odors, and absence of unsightly coatings; this is collectively a result of the lack of nitrogen-, phosphorus-, and carbon-based waste available. Aquaria that are relatively rich in available nutrients have characteristics opposite to the aforementioned, and are typically not desirable because of the resultant appearance of the system and the difficulty of maintaining healthy aquarium inhabitants. Brightwell Aquatics MicroBacter Clean is a selective complex of extremely effective microbes and enzymes that not only reduce the concentrations of organic nitrogen, ammonia, nitrite, nitrate, phosphate, and organic carbon in all marine ecosystems, but make maintenance easy by actually loosening accumulations and coatings. Notes: It is normal that clumps may form in the product and the product and the aquarium may have an “earthy” smell or smell “off” and the aquarium water could become cloudy and the smell and cloudiness could remain for many hours after using. This is due to the bacteria themselves and is an indication of quality and is the reason it is necessary to shake product well immediately before using. MicroBacter Clean does not require refrigeration, however storage in a cool, shaded area or refrigeration at 50 deg F to maximize shelf-life of the product. Keep away from heat.\nMicroBacter Clean – 250ml, 500ml.\n \n"},"101":{"No":"101","product_name":"MicroBacter CWM 500 oz","price":"₹2450.00","category":"WATER FILTERATION & TREATMENT","image":"UYGUHG.jpg","description":"\nOverview Formulated specifically for temperate (cold water) marine aquaria. Dual-phase microbial and enzymatic blend which establishes and maintains biological filtration, enhances the rate of nitrification and denitrification, and reduces amount of latent dissolved- and particulate-organic material in all temperate marine aquaria down to a temperature of 40°F (~4°C). Benefits to temperate marine aquaria are: Rapid reduction of organic carbon, ammonia, nitrite, nitrate, and phosphate; Digestion of uneaten\/undigested food, excreta, detritus, and other latent organic material, resulting in cleaner and healthier aquarium substrate (without having to physically clean or disturb the substrate bed); Reduction of organic compounds into nutrients that encourage the growth of photosynthetic organisms (e.g. zooxanthellae, macro-\/microalgae); Greatly-reduced hydrogen sulfide production; Increase in dissolved oxygen concentration; Decreased availability of existing phosphate to undesirable forms of algae and cyanobacteria; Increased water clarity. Supplied in a state of suspended animation for maximum longevity. Sizes 250-, 500-ml, 2-, 20-L\n"},"102":{"No":"102","product_name":"MicroBacter Start XLM -250ml","price":"₹2900.00","category":"WATER FILTERATION & TREATMENT","image":"91jj1DB3VxL-3.jpg","description":"\nAbout this item Useful for rapidly re-establishing nitrification bacteria in case of an emergency Particularly useful in aquaria with high population densities and when adding new fish Helpful to re-establish nitrifying bacteria after cleaning rocks and surfaces and after use of medications. Rapid reduction of ammonia, and nitrite. Prevents “New Tank Syndrome.” ›See more product details.\n"},"103":{"No":"103","product_name":"MicroBacter7","price":"₹1690.00","category":"WATER FILTERATION & TREATMENT","image":"uiguhghy.jpg","description":"\nOverview: Complex system of non-pathogenic aerobic and anaerobic microbes, as well as natural enzymes, specifically formulated to establish biological filtration in new aquarium set-ups, and to enhance the rate of nitrification, denitrification, and organic waste degradation in marine and freshwater aquaria through complete nutrient remineralization. Benefits are: 1. Rapid reduction of organic carbon, ammonia, nitrite, nitrate, and phosphate.2. Digestion of uneaten\/undigested food, excreta, detritus, and other latent organic material, resulting in cleaner and healthier aquarium substrate (without having to physically clean or disturb the substrate bed).3. Reduction of organic compounds into nutrients that encourage the growth of photosynthetic organisms (e.g. zooxanthellae, macroalgae, plants).4. Greatly-reduced hydrogen sulfide production.5. Increase in dissolved oxygen concentration.6. Limits availability of pre-existing phosphate to undesirable forms of algae and cyanobacteria.7. Increased water clarity. Supplied in a state of suspended animation for maximum longevity. Formulated utilizing extensive data compiled by microbiologists. Technical Background The concentration of dissolved and particulate organic materials in any aquatic environment can have a significant impact on the overall appearance of, as well as the health of organisms residing within, that system. Relatively low-nutrient environments are characterized by high water clarity, lack of unpleasant odors, and absence of microalgae and cyanobacteria; this is collectively a result of the lack of nitrogen-, phosphorus-, and carbon-based waste available. Aquaria that are relatively rich in available nutrients have characteristics opposite to the afore-mentioned, and are typically not desirable because of the resultant appearance of the system and the difficulty of maintaining healthy aquarium inhabitants. Brightwell Aquatics MicroBacter7 is a selective complex of extremely effective microbes and enzym.\n \nMicroBacter 7 – 250ml, 500ml\n"},"104":{"No":"104","product_name":"MILWAUKEE MC 120 PH MONITOR","price":"₹9200.00","category":"DOSING PUMP & AUTOMATION","image":"800x-1-598x598.jpg","description":"\nThe MC120 controller automatically monitors and fine-tunes the pH levels. Just set your pH parameters and let the Milwaukee pH Controller do the rest. The Milwaukee PRO pH controller is preferred by people looking to dial in their testing program when they have an ongoing need to maintain levels. Common uses are nutrient tanks and aquariums. RANGE: 0.0 – 14.0 pHRESOLUTION: 0.1 pHACCURACY: +\/-0.2 pHCALIBRATION: Manual 2 pointMANUAL: Milwaukee MC120 Manual\n"},"105":{"No":"105","product_name":"MILWAUKEE MC 122 PH CONTROLLER","price":"₹14500.00","category":"DOSING PUMP & AUTOMATION","image":"milwaukee-122-598x763.png","description":"\nThe MC122 controller automatically monitors and fine-tunes the pH levels. Just set your pH parameters and let the Milwaukee pH Controller do the rest. The Milwaukee PRO pH controller is preferred by people looking to dial in their testing program when they have an ongoing need to maintain levels. Common uses are nutrient tanks and aquariums. RANGE: 0.0 – 14.0 pHRESOLUTION: 0.1 pHACCURACY: +\/-0.2 phCALIBRATION: Manual, 2 PointMANUAL: Milwaukee MC122 Manual\n"},"106":{"No":"106","product_name":"Mineral Refugium Aquarium Mud (1 Gallon) – Caribsea","price":"₹3850.00","category":"MEDIA & SANDS","image":"187d58e8-b8b1-4387-ad15-5c51a06b200d_2.37520b19285ac82ca351572a29391dcd-598x598.jpeg","description":"\nA unique blend of sediments that duplicate tropical fringing coastal mangrove environments. Its particles are in a size range compatible with soft, burrowing infaunal, macro animal assemblages. Ideal for mud refugiums, seagrasses, macro-algaes, and mangroves, Mineral Mud™ provides a variety of trace elements plus calcium, strontium, iron, sulfur and free carbon. In addition, Mineral Mud™ contains live marine bacteria to complete the tropical ecosystem.\nBring a bit of the Caribbean home with CaribSea, Inc., maker of environmental accessories for aquariums. CaribSea Mineral Mud Refugium Substrate is a blend of sediments that duplicate tropical fringing coastal mangrove environments. Compatible with soft, burrowing infaunal, macro animal assemblages, Ideal for mud refugiums, seagrasses, CaribSea Mineral Mud Refugium Substrate has trace elements plus calcium, strontium, iron, sulfur and free carbon.\n"},"107":{"No":"107","product_name":"N\/P Reducing Biopallets 500 Ml","price":"₹2455.00","category":"WATER FILTERATION & TREATMENT","image":"biopellets-np-reducing-500ml-598x598.jpg","description":"\nBioPellets are consumed by bacteria, which is why new pellets need to be added every 6-12 months to compensate for digested fILTER MEDIA\n"},"108":{"No":"108","product_name":"Neo Mag -1kg","price":"₹1950.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"Untitled-1-Recovered-s-598x598.jpg","description":"\nHigh-purity magnesium media for placement in reef aquarium media reactors.\nHigh-purity, magnesium-rich mineral that may be employed in traditional calcium reactors, or even blended in to pre-existing aquarium substratum, to gradually increase and maintain the magnesium concentration in the system.\nProvides magnesium, which helps regulate the balance between calcium and carbonates in aquarium water, and is a component of aragonite, the mineral secreted by reef-building organisms to form skeletal material.\nComposed of magnesium, calcium, and carbonates.\nOptimal average particle size for use in media reactors and calcium reactors.\nFree of chloride and sulfate.\nMined in the United States.\nInstructions: Rinse material in freshwater or saltwater prior to initial placement in aquarium system. Employ in a calcium reactor (main chamber or secondary chamber) at a total ratio of approximately 9:1 aragonite: NeoMag by volume. The rate of water flow through the reactor in conjunction with the pH of the water inside the chamber(s) will have the greatest impact on the rate of media dissolution. Follow the manufacturer’s instructions furnished with the calcium reactor to adjust the rates of water flow and CO2-injection and attain the desired concentrations of magnesium and calcium in the effluent. Measure alkalinity, calcium, and magnesium concentrations in the aquarium two- to four-times each month during the course of using NeoMag to ensure that parameters are within the desired ranges, and make adjustments to reactor system as required. As the biomass of corals and other reef-building organisms residing within an aquarium increase with time, so the bio demand of calcium, magnesium, and carbonates increases, as well; this being the case, the frequency at which aragonite and NeoMag must be replaced will increase.\n"},"109":{"No":"109","product_name":"NeoNitro -250ml","price":"₹1090.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"51nljk5hrVL._SX522_.jpg","description":"\nUsed in conjunction with MICROBACTER7 and REEF BIOFUEL or KATALYST, enables natural phosphorus uptake to take place in systems with inadequate nitrogen content, lowering phosphate concentration without the use of chemical filtration media and without resorting to polluting the system with organic material to raise the nitrogen content. Recommended for use by advanced reef aquarists maintaining ultra-low nutrient content systems, only. May be used with MICROBACTER7 (selected microbes and enzymes), REEF BIOFUEL and\/or KATALYST (organic carbon source), and NEOPHOS (phosphorus source) to achieve desired nutrient content in reef aquaria for improved health and coloration of inhabitants\n"},"110":{"No":"110","product_name":"NeoPhos -250ml","price":"₹1050.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"dohfidhf.jpg","description":"\nBrightwell NeoPhos is phosphorus supplement for Ultra-Low Nutrient Reef Aquarium Systems (ULNS). Although the product isn’t “new” it deserves a bit of Reef Builders attention. For those of you running ULNS systems, NeoPhos is a balanced nitrogen source for these types of environments. Brightwell Aquatics recommends using it in conjunction with with MICROBACTER7 and REEF BIOFUEL or KATALYST. NeoPhos enables, “natural phosphorus uptake to take place in systems with inadequate nitrogen content, lowering phosphate concentration without the use of chemical filtration media and without resorting to polluting the system with organic material to raise the nitrogen content.”\n"},"111":{"No":"111","product_name":"Noopsyche K7  Arm Bracket","price":"₹3000.00","category":"AQUARIUM LIGHTS","image":"mounting-bracket-for-noopsyche-k7-pro-2-led-light-598x646.jpg","description":"\narm bracket or stand for noopsyche led\n"},"112":{"No":"112","product_name":"Noopsyche K7 Controller","price":"₹5000.00","category":"AQUARIUM LIGHTS","image":"download-2-2.jpg","description":"\ncontroller for noopsyche led\n"},"113":{"No":"113","product_name":"Noopsyche K7 Reef Aquarium Led Lights","price":"₹19800.00","category":"AQUARIUM LIGHTS","image":"fghhgf-598x451.jpg","description":"\nNoopsyche k7 pro full spectrum reef aquarium LED light coral lights like sunrise and sunset sps lps fot saltwater coralline\n"},"114":{"No":"114","product_name":"Phosphat-E 250ML","price":"₹2750.00","category":"WATER FILTERATION & TREATMENT","image":"71lcEwjup2L._SX522_.jpg","description":"\n\nBegins to eliminate reactive phosphate immediately upon addition to aquarium.\nSafe for all inhabitants of reef and marine fish-only aquaria.\nEach ml eliminates 1 ppm phosphate in 4 US-gallons of water\n(250 ml treats 1,000 US-gal).\nHelps facilitate the removal of phosphate from aquaria during periods when dissolved\norganic material is abundant.\nMay be used on an ongoing basis to help control phosphate in heavily-stocked aquaria.\nOver 50% stronger than most competing products.\nFormulated by a marine scientist.\n\nIngredients\nPurified water, proprietary phosphate removers.\n"},"115":{"No":"115","product_name":"Purit – Chemical Filtration Media -1000ml","price":"₹4350.00","category":"WATER FILTERATION & TREATMENT","image":"purit-1l-1200x1200-1-598x598.jpg","description":"\nBrightwell Aquatics Purit is a next-generation combination of enhanced activated carbon and NSF-grade ion-exchange and adsorptive resins to enhance removal of impurities such as chloramines, ammonia, nitrate, phosphate, silicate, heavy metals, and dissolved organic material from water. This enhanced filter media offers superior chemical filtration characteristics when compared to traditional activated carbon. Purit facilitates decomposition and enhances oxidation-reduction potential (ORP). This filter media also improves water clarity and water quality by removing dyes and discoloration, eliminating odors related to decaying organic material, and removing copper, lead, and other heavy metals from your tank. Completely safe for use in all reef, mixed-reef, fish-only, community, and planted aquaria.\n"},"116":{"No":"116","product_name":"Pvc Plumbing Retuned U-Tube","price":"₹695.00","category":"ACCESSORIES","image":"313rSVs5gJL.jpg","description":"\nu tube for aqurium\n"},"117":{"No":"117","product_name":"Razor marine -250ml","price":"₹1575.00","category":"WATER FILTERATION & TREATMENT","image":"HJFVGFTR.jpg","description":"\nIt is recommended that activated carbon use be suspended while using this product, as activated carbon can reduce the product’s effectiveness. Once the aquarium has attained the desired appearance, activated carbon can be put back into the filtration system, if desired. Due to the rate at which filters collect particulate material, it may be necessary to clean mechanical filter pads and other media every other day while dosing this product. Simultaneous use with MicroBacter Clean will have a very synergistic effect. If using with MicroBacter Clean, add it first and then wait several hours to add the Razor Marine. Active protein skimming and sensible feeding should be the first steps taken to minimize turbidity and the concentration of dissolved organic materials in any marine aquarium. Water of high clarity that is low in dissolved organic material and possesses the proper parameters is the basis for a healthy aquarium system! Razor Marine is slow acting and may require multiple applications to achieve the effect desired by the user. Used as directed, it is safe for marine fishes, hard and soft corals, and other inverts, as well as most macro-algae, however, as all animals are individuals, and water conditions vary in many aquariums, animals should be observed closely during use, for signs of stress (corals closing and not re-opening, erratic behavior etc.). If signs of stress occur, or if macro-algae are affected negatively, reduce or discontinue use as necessary. If symptoms persist, do a partial water change and add carbon.\n"},"118":{"No":"118","product_name":"Reef Biofuel Liquid -500ml","price":"₹2780.00","category":"WATER FILTERATION & TREATMENT","image":"71qbpCEXgTL._SX522_.jpg","description":"\nHelps maintain a balanced nutrient-limited marine aquarium by enabling the hobbyist to enhance the rate of microbial growth and reproduction, increasing the rate of phosphate-reduction and DE nitrification; this is of particular benefit in heavily-stocked, well-fed reef aquaria.\n"},"119":{"No":"119","product_name":"Reef code A","price":"₹2350.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"JHGHGFYTF.jpg","description":"\nThis method of calcium and carbonate supplementation is advantageous to hobbyists interested in a simple and effective means of providing the very elements and molecules required for growth of reef-building organisms such as corals, clams, and their allies. Corals and other reef-building organisms require adequate and stable available calcium and alkalinity to thrive. Under most conditions, the mineral that is secreted as skeletal material is known as Aragonite, composed mostly of carbonate and calcium by weight. Reef-building organisms must extract these substances from the surrounding water in order to secrete new skeletal material for growth. By maintaining the same ratio of calcium ions and carbonates in an aquarium as that found in natural seawater, these organisms have the necessary building blocks available in the proper proportions, even if the hobbyist chooses to maintain higher concentrations of these substances. For maximum effectiveness of the Reef Cōde method, the magnesium concentration in reef aquaria should be adjusted to, and maintained between, 1, 290 – 1, 320 ppm before using these products (alone or together) or any other calcium and alkalinity products. Doing so helps prevent unwanted precipitation between calcium and carbonate ions. Additional information on this subject is available on our website and on the label for Brightwell Aquatics Magnesion. The rate at which calcium and carbonates are extracted from the water is determined by the stocking density of reef-building livestock, type of lighting, and other conditions; therefore, each aquarium will have different requirements for the rate of supplementation. Once the rate of calcium uptake in the aquarium has been determined, the proper dosing rate of this product can be easily calculated.\nAbout this item\n\n\n\nSimplifies calcium and alkalinity maintenance in your aquarium tank\nThe carbonate-bearing component of a two-part method for dosing calcium and carbonates in the same ratio as that found in natural seawater; to be used in conjunction with Reef Code B\nBenefits reef-building organisms such as corals, clams, and calcareous algae\nContains no phosphate, silicate, or organic material; Made in the USA\nContains no phosphate, silicate, or organic material.\n\n\n\n"},"120":{"No":"120","product_name":"Reef code B","price":"₹2350.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"HFGYHYG.jpg","description":"\nThis method of calcium and carbonate supplementation is advantageous to hobbyists interested in a simple and effective solution to providing the very elements and molecules required for growth of reef-building organisms such as corals, clams, and their allies. Corals and other reef-building organisms require adequate and stable available calcium and alkalinity if they are to thrive, regardless of how perfect the remainder of their environment is. Under most conditions, the mineral that is secreted as skeletal material is known as Aragonite, composed mostly of carbonate and calcium by weight. Reef-building organisms must extract these substances from the surrounding water in order to secrete new skeletal material for growth. By maintaining the same ratio of calcium ions and carbonates in an aquarium as that found in natural seawater, these organisms have the necessary building blocks available in the proper proportions, even if the hobbyist chooses to maintain higher concentrations of these substances. For maximum effectiveness of the Reef Code method, the magnesium concentration in reef aquaria should be adjusted to, and maintained between, 1, 290-1, 320 ppm before using these products (alone or together) or any other calcium and alkalinity products. Doing so helps prevent unwanted precipitation between calcium and carbonate ions. Additional information on this subject is available on our website and on the label for Brightwell Aquatics Magnesion. The rate at which calcium and carbonates are extracted from the water is determined by the stocking density of reef-building livestock, type of lighting, and other conditions; therefore, each aquarium will have different requirements for the rate of supplementation. Once the rate of alkalinity depletion in the aquarium has been determined, the proper dosing rate of this product can be easily calculated.\n"},"121":{"No":"121","product_name":"Rowa Carbon 5000Gms","price":"₹6500.00","category":"WATER FILTERATION & TREATMENT","image":"fnlepdom50l-598x598.jpg","description":"\nHigh performance activated carbon for crystal clear water in freshwater and saltwater aquariums.\n"},"122":{"No":"122","product_name":"Salifert Ammonia Test Kit","price":"₹1210.00","category":"WATER CONTROLLER & TESTING","image":"22039_11-598x598.jpg","description":"\nSalifert test kits are the epitome of accuracy and precision. Their wide range of available tests have all been designed to detect the smallest traces of certain elements, without interference from other chemicals within the water. Simply put, these are the best test kits you can buy- hands down. The sharp, contrasting color changes make results easy to read so there’s no second guessing. Trust your aquarium to Salifert. Test your water for even the smallest amounts of phosphate with this test kit. See if phosphate is the culprit behind those algae problems For freshwater and saltwater. This item not available for backorders.\n"},"123":{"No":"123","product_name":"Salifert Calcium Test Kit","price":"₹1375.00","category":"WATER CONTROLLER & TESTING","image":"662010-598x780.jpg","description":"\nIn order to keep pace with never ending demands of the customers, our company is instrumental in offering Salifert Calcium Test Kit.\n"},"124":{"No":"124","product_name":"Salifert Flat Worm Exit","price":"₹1375.00","category":"WATER CONTROLLER & TESTING","image":"salifert-salifert-flatworm-exit-10ml.jpg","description":"\nSalifert test kits are the epitome of accuracy and precision. Their wide range of available tests have all been designed to detect the smallest traces of certain elements, without interference from other chemicals within the water. Simply put, these are the best test kits you can buy- hands down. The sharp, contrasting color changes make results easy to read so there’s no second guessing. Trust your aquarium to Salifert. Test your water for even the smallest amounts of phosphate with this test kit. See if phosphate is the culprit behind those algae problems For freshwater and saltwater. This item not available for backorders.\n"},"125":{"No":"125","product_name":"Salifert Kh\/Alk Test Kit","price":"₹865.00","category":"WATER CONTROLLER & TESTING","image":"662001.jpg","description":"\nEasily test the kH\/Alkalinity level in your tank. Trusted by discerning reefers for years, Salifert Test Kits feature some of the easiest to read results available to each testing method. The Salifert kH\/Alkalinity Test Kit contains 100-200 (typically closer to 100) tests.exp : 2026\n"},"126":{"No":"126","product_name":"Salifert Magnesium Test Kit","price":"₹1375.00","category":"WATER CONTROLLER & TESTING","image":"s-l500.jpg","description":"\nSalifert test kits are the epitome of accuracy and precision. Their wide range of available tests have all been designed to detect the smallest traces of certain elements, without interference from other chemicals within the water. Simply put, these are the best test kits you can buy- hands down. The sharp, contrasting color changes make results easy to read so there’s no second guessing. Trust your aquarium to Salifert. Test your water for even the smallest amounts of phosphate with this test kit. See if phosphate is the culprit behind those algae problems For freshwater and saltwater. This item not available for backorders.\n"},"127":{"No":"127","product_name":"Salifert Nitrate","price":"₹1060.00","category":"WATER CONTROLLER & TESTING","image":"salifert-nitrate-no3-test-kit-500x500-1.jpg","description":"\nSalifert test kits are the epitome of accuracy and precision. Their wide range of available tests have all been designed to detect the smallest traces of certain elements, without interference from other chemicals within the water. Simply put, these are the best test kits you can buy- hands down. The sharp, contrasting color changes make results easy to read so there’s no second guessing. Trust your aquarium to Salifert. Accurately measure the tiniest amount of nitrite without interference from amines. For saltwater or freshwater.\n"},"128":{"No":"128","product_name":"Salifert Nitrite Test Kit","price":"₹1045.00","category":"WATER CONTROLLER & TESTING","image":"red-sea-mcp-nitrite-test-kit-500x500-1.jpg","description":"\nSalifert test kits are the epitome of accuracy and precision. Their wide range of available tests have all been designed to detect the smallest traces of certain elements, without interference from other chemicals within the water. Simply put, these are the best test kits you can buy- hands down. The sharp, contrasting color changes make results easy to read so there’s no second guessing. Trust your aquarium to Salifert. Accurately measure the tiniest amount of nitrite without interference from amines. For saltwater or freshwater.\n"},"129":{"No":"129","product_name":"Salifert Ph Test Kit","price":"₹1045.00","category":"WATER CONTROLLER & TESTING","image":"51gMCmz4qJL.jpg","description":"\nSalifert test kits are the epitome of accuracy and precision. Their wide range of available tests have all been designed to detect the smallest traces of certain elements, without interference from other chemicals within the water. Simply put, these are the best test kits you can buy- hands down. The sharp, contrasting color changes make results easy to read so there’s no second guessing. Trust your aquarium to Salifert. Easy to read color change and fast results allows you to effortlessly test your marine water for the correct pH.\n"},"130":{"No":"130","product_name":"Salifert Po4 Kit","price":"₹1150.00","category":"WATER CONTROLLER & TESTING","image":"51790QZvXzL.jpg","description":"\nSalifert test kits are the epitome of accuracy and precision. Their wide range of available tests have all been designed to detect the smallest traces of certain elements, without interference from other chemicals within the water. Simply put, these are the best test kits you can buy- hands down. The sharp, contrasting color changes make results easy to read so there’s no second guessing. Trust your aquarium to Salifert. Test your water for even the smallest amounts of phosphate with this test kit. See if phosphate is the culprit behind those algae problems For freshwater and saltwater. This item not available for backorders.\n"},"131":{"No":"131","product_name":"Single Lock line 20mm","price":"₹575.00","category":"ACCESSORIES","image":"51OAKxsccEL._SY355_.jpg","description":"\nSingle Lock line 20mm\n"},"132":{"No":"132","product_name":"Smart Auto Fedder Fish Food","price":"₹1850.00","category":"ACCESSORIES","image":"H7ebbb2e39a2644188cb6338e8a43e86cd-598x598.jpg","description":"\nSmart Automatic Fish Feeder Aquarium Feeder Fish Tank Auto Feeding Dispenser with LCD Indicates Timer Aquarium Accessories Specifications Product: Smart Automatic Fish Feeder Size: 15×7.5x11cm Capacity: 200ml Fish tank thickness: ?25mm Powered: 2xAA battery (not included) Timing: set 4 times Type:3 types Function: Smart Automatic Feeding Application: fish feeding such as granules, flakes and powders Product type: Aquarium Service\n"},"133":{"No":"133","product_name":"Stylo Pocci Glow-50Ml","price":"₹2950.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"korallenzucht-stylo-pocci-glow-50ml.jpg","description":"\nStylo-Poci-Glow regulates the density of zooxanthellae in Pocillopora, Stylophora and Seriatopora. Supports a natural and strong color formation.\n"},"134":{"No":"134","product_name":"Titinum Heat Exchanger","price":"₹8750.00","category":"ACCESSORIES","image":"OIHHYTG.jpg","description":"\nPVC shell titanium coil tube heat exchanger for aquarium chiller\n1.5hp, 2hp PVC shell titanium coil tube heat exchanger for aquarium chiller\n \n"},"135":{"No":"135","product_name":"Vast Ocean Veg Mag Feddig Clip","price":"₹650.00","category":"ACCESSORIES","image":"H50e65b44304f4080b641b0d29d390ae1X-598x598.jpg","description":"\nVastOcean Veggie-Mag Feeding Clip Aquarium Fish Tank Strong Magnetic Algae Vegetable Clip\n"},"136":{"No":"136","product_name":"Your Choice Aqautics  Fluide Multi Reactors Mf100","price":"₹4650.00","category":"MEDIA REACTORS","image":"MF100-with-new-union-598x897.jpg","description":"\nYOUR CHOICE AQUATICS Reactor MF100\n"},"137":{"No":"137","product_name":"your choice aquatic filter cup","price":"₹850.00","category":"CLEANING TOOLS","image":"315tZgSG4VL.jpg","description":"\nThe IceCap 4in Media Cup can hold just about any type of filtration media, from filter floss, ceramic media, carbon or GFO. Just put the Media Cup in place of your 4″ filter sock and fill it with your favorite filter media. High-flow slots are cut at the bottom of the media cup ensuring water is forced to travel all the way down to the bottom of the cup and giving all your media proper contact time. We highly recommend containing any loose media in the included mesh media bag.\nThe Filter Media Cup is an ideal and cost-effective replacement to filter socks as well. If all you want is to polish the water of free-floating particles, then placing a few handfuls of a filter floss in the cup and simply replace the dirty filter media every few days.\n\nReplaces 4in filter socks\nCreate your own custom filter tower\nCompatible with most pre-made sumps Including IceCap and RedSea\nIncludes media bag\n\n"},"138":{"No":"138","product_name":"your choice aquatic potical refractometer","price":"₹2050.00","category":"MEDIA REACTORS","image":"pce-instruments-handheld-refractometer-pce-oe-winegrower-62611_870885.jpg","description":"\nSeawater Refractometer 0-10% 1.000-1.070SG Optical Salinity Meter Salometer for Seawater Marine Aquaculture Food Salt Tester\n"},"139":{"No":"139","product_name":"Your Choice Aquatics Eco Dc Pump","price":"₹7720.00","category":"AQUARIUM PUMP & WAVE MAKER","image":"jghhf.jpg","description":"\nYour Choice Aquatics Eco Dc Pump –\nDC4000 4000L\/H 4 meter head 10-35 watt Two modes, constant speed and pulsing to create random and wave moving in the tank.\nDC6500 6500L\/H 4 meter head 10-80 watt Two modes, constant speed and pulsing to create random and wave moving in the tank.\nDC10000 10000L\/H 5 meter head 10-85 watt Two modes, constant speed or pulsing to create wave.\nDC12000 12000L\/H 5 meter head 10-100 watt Two modes, constant speed or pulsing to create wave.\nPump – DC4000, DC6500, DC10000, DC12000\n"},"140":{"No":"140","product_name":"Your Choice Aquatics Ew Wave Pump","price":"₹6195.00","category":"AQUARIUM PUMP & WAVE MAKER","image":"15310.jpg","description":"\nYour Choice Aquatic Ew-10 Wave Makers –\nModel EW-10 Power 10w 110-240V 50\/60hz Output DC24v at 1.0A 4000 L\/H or approximately 1056 GPH Suggested 60cm \/24″ long tank or 8mm\/.31″ thickness Product size 62x86mm (2.44″x3.39″) Key Benefits Features different flow rates so you can always have the perfect water flow in your tank. It has an easy-to-use central control system that lets you adjust speed, flow, and wave pattern. Automatically slows down at night so your fish can sleep and is ideal for both freshwater and saltwater tanks. One-button feed mode lets you slow down the pump for 10 minutes to make feeding time easy. Works on low power and comes in different capacities from 1,000 to 3400 gallons per hour; installs easily with magnetic base.\nYour Choice Aquatic Ew-25 Wave Makers –\nYour Choice Aquatics Wave Pump Model EW-25 Power 23w 110-240V 50\/60Hz Output DC24v at 1.5A 8000 L\/H or approximately 2100 GPH Suggested 80-100cm \/31-39″ long tank or 10-12mm\/.39-.47″ thickness Product size 78x108mm (3.07″x4.25″) Key Benefits Features different flow rates so you can always have the perfect water flow in your tank. It has an easy-to-use central control system that lets you adjust speed, flow, and wave pattern. Automatically slows down at night so your fish can sleep and is ideal for both freshwater and saltwater tanks. One-button feed mode lets you slow down the pump for 10 minutes to make feeding time easy. Works on low power and comes in different capacities from 1,000 to 3400 gallons per hour; installs easily with magnetic base.\nYour Choice Aquatic Ew-40 Wave Makers –\nYour Choice Aquatics Wave Pump Model EW-40 Power 40w 110-240V 50\/60Hz Output DC24v at 2.5A 13000 L\/H or approximately 3430 GPH Suggested 100-120cm \/39-47″ long tank or 12-15mm\/.47-.59″ thickness Product size 92x132mm (3.62″x5.20″) Key Benefits Features different flow rates so you can always have the perfect water flow in your tank. It has an easy-to-use central control system that lets you adjust speed, flow, and wave pattern. Automatically slows down at night so your fish can sleep and is ideal for both freshwater and saltwater tanks. One-button feed mode lets you slow down the pump for 10 minutes to make feeding time easy. Works on low power and comes in different capacities from 1,000 to 3400 gallons per hour; installs easily with magnetic base.\n \n"},"141":{"No":"141","product_name":"Zeostart 3-100Ml","price":"₹1850.00","category":"MARINE WATER ESSENTIALS & ADDITIVIES","image":"1322_n77kcsichef1-598x598.jpg","description":"\nZEOstart 3 was developed for reefers who want optimum water parameters in a biological way. It promotes the reproduction of all nitrifying bacteria in the aquarium and is therefore very effective in reducing phosphate and nitrate, nitrite and several inhibitors.\n"},"142":{"No":"142","product_name":"Redsea Coral Pro Salt 22kg","price":"₹7000","category":"MARINE SALT","image":"1322_n77kcsichef1-598x598.jpg","description":"\nRed Sea Coral Pro Salt contains biologically balanced, elevated levels of the foundation elements necessary for sustainable, accelerated coral growth. Red Sea Coral Pro Salt is ideal for reef aquariums, in particular for LPS and SPS corals, and for growing coral frags. Red Sea Coral Pro Salt is a specialty salt mix formulated for today’s advanced reef aquariums. A scientifically formulated marine salt is based on using pure water. This is necessary to accurately calculate all the elements required to recreate tropical seawater. It is the best way to create a baseline salt formulation that most precisely mirrors the reef environment. Research laboratories and professional aquaculture facilities often use ultra-pure reverse osmosis and deionized mineral-free water for mixing saltwater. Reef aquarists using RO or RO\/DI can have this same level of “saltwater perfection” with Red Sea Coral Pro Salt. Coral Pro Salt is intended to stimulate growth of SPS and LPS corals in aquariums and frag tanks. The coral-building process of calcification demands adequate levels of Foundation Elements: calcium, magnesium and bio-available carbonates. These elements play a key role in coral metabolism and growth, pH stabilization and ionic strength of the saltwater. Coral Pro Salt contains the levels of foundation elements and trace elements necessary for coral growth in your aquarium. You wont have to use additives to “fix” your freshly made saltwater!\n"},"143":{"No":"143","product_name":"Quantum HR Nitrate Remover","price":"₹872","category":"FILTER MEDIA","image":"3602_1_592Quantum_HR_nitrate_remover.jpg","description":"\nQuantum HR Nitrate Remover is designed for aquariums that have higher than 15ppm nitrate.It is formulated specifically to reduce high nitrate within marine\/reef environments and works by providing bioavailable carbon sources to denitrifying bacteria present in media, deep sand beds & inner pores of live rock.The bacteria oxidise the carbon into carbon dioxide while reducing nitrate to chemically inert nitrogen gas. If you are experiencing nitrate 15ppm or lower, we recommend using our LR Nitrate Remover\n"},"144":{"No":"144","product_name":"Quantum Phosphate Remover","price":"₹872","category":"FILTER MEDIA","image":"3612_1_88Quantum_Phosphate_Remover.jpg","description":"\nQuantum Phosphate Remover - Phosphate Remover is designed to eliminate both ionic & chemically bound phosphate in marine\/reef aquariums.Phosphate exists as ionic and chemically bound by calcium, this causes fluctuations of calcium, stunted coral growth rates as well as the false reading of low phosphate due to the inability for test kits to be able to test for bound phosphate. Media & carbon sources remove the ionic phosphate but take long to remove the bound phosphate due to its high stability.Our phosphate remover will precipitate out both ionic and chemically bound phosphate and place it in existing filter wool\/socks. Note: A fine white film building on the glass indicates that you are overdosing, we recommend adjusting your dose and using our White Film Remover to safely clean any build up.\n"},"145":{"No":"145","product_name":"Coral Feast Coral Food 60G","price":"₹1290","category":"CORAL FOOD","image":"Best_Coral_Food.png","description":"\nWillows Reef Coral Feast is a powdered food supplement, designed to entice a feeding response from filter-feeding Corals and invertebrates, and is formulated to promote and stimulate growth and coloration.Coral Feast was formulated to help promote the best color and growth of your corals.It is made with 100% natural ingredients with no fillers.\n"},"146":{"No":"146","product_name":"RedSea Reef Energy Plus AB 500ML","price":"₹2040","category":"CORAL FOODS AND AMINO ACIDS","image":"3893_1_542.jpg","description":"\nAn all-in-one superfood that will have your corals thanking you, delivering better growth, higher resilience, brighter colors, greater ease of use with automatic dosers, and minimal over skimming.Based on our long-term research, Reef Energy Plus is an enhanced supplement that provides the complete nutritional components needed by Soft, LPS, SPS, and non-photosynthetic corals for vitality, growth, and coloration.\n"},"147":{"No":"147","product_name":"Redsea No3Po4x","price":"₹1530","category":"ALGAE CLEANERS","image":"3877_1_398.jpg","description":"\nRed Sea NO3 PO4 X is a unique complex of carbons that are used by nutrient reducing bacteria. Each carbon in the complex is utilized by different strains of microorganisms while ensuring the specific Carbon, Nitrogen, and Phosphorus ratio required for each stage.The Red Sea NO3  PO4 X complex includes other organic-bonded elements that are important stimulators in each stage of the reduction process. These metal and non-metals elements ensure steady bacterial propagation, complete nitrate reduction to nitrogen gas as well as the absorption and utilization of phosphate by the bacteria.\n"},"148":{"No":"148","product_name":"Hikari Marine S 50gm","price":"₹405","category":"MARINE FISH FOOD","image":"Hikari_Marine_S_50gm.jpg","description":"\nContains numerous necessary high-level proteins marine fish require & garlic too!, When used as a daily diet you can expect vibrant coloration and desirable form as a result of the finely tuned, highly flavorful nutrient mix. This proprietary pellet, sinks slowly while rapidly becoming sponge-like and replicating the texture of a live reef environment.\n"},"149":{"No":"149","product_name":"PolypLab Reef Safe Medic","price":"","category":"TREATMENTS","image":"Polyp_Lab_Reef_Safe_Medic.png","description":"\nMedic is a highly effective water conditioner used to de-pollute water in both marine and freshwater environments. It contains a reef-safe oxidizing agent and is particularly effective against Marine Ich - Crytopocaryon Irritant as well as others. \n"},"150":{"No":"150","product_name":"ReefRevolution Parasite Remover 50gm","price":"","category":"TREATMENTS","image":"ReefRevolution_Parasite_Remover_50gm.jpg","description":"\nReef Revolution reef safe parasite treatment is a highly effective reef safe method for treating fish parasites such as Marine Ich (Cryptocaryon Irritants), freshwater Ich (Ichthyophthirius) and Marine Velvet (Amyloodinium Ocellatum). Use as directed on product label for best results.Marine Ich has a long life cycle and treatment is recommended for a minimum of 14 days\n"},"151":{"No":"151","product_name":"Hikari Marine A 110gm","price":"₹615","category":"MARINE FISH FOOD","image":"Hikari_Marine_A_110gm.jpg","description":"\nOffers essential fatty acids and necessary high-level proteins as part of the scientifically balanced nutrition.Contains clam extract which improves palatability, even finicky eaters will love it.Offers seaweed meal and pure-cultured spirulina to meet the nutritional requirements of plant eating marine fishes, while providing them the nutrient sources they require to look like they just came off the reef.A unique blend of necessary nutrients which help support immune system health.Softens rapidly while triggering natural, instinctual grazing. The easily digested formula aids utilization thereby reducing waste output and helping to improve water quality with continued use.\n"},"152":{"No":"152","product_name":"Mantis UV Staliazer – 55watts","price":"₹7300","category":"AQUARIUM LIGHTS","image":"part-1-598x598.jpg","description":"\nHigh Quality Quartz lamp Wick long life. 360° full Range of sterilization and no Secondary pollution. suggested sizes are based on end of bulb life to ensure continuous results. unique design maximizes the effective contact time by utilizing the full bulb length.UV Lights – 55watts\n"},"153":{"No":"153","product_name":"Mantis UV Staliazer – 18watts","price":"₹4450","category":"AQUARIUM LIGHTS","image":"part-1-598x598.jpg","description":"\nHigh Quality Quartz lamp Wick long life. 360° full Range of sterilization and no Secondary pollution. suggested sizes are based on end of bulb life to ensure continuous results. unique design maximizes the effective contact time by utilizing the full bulb length.UV Lights – 55watts\n"},"154":{"No":"154","product_name":"Mantis UV Staliazer – 36watts","price":"₹5950","category":"AQUARIUM LIGHTS","image":"part-1-598x598.jpg","description":"\nHigh Quality Quartz lamp Wick long life. 360° full Range of sterilization and no Secondary pollution. suggested sizes are based on end of bulb life to ensure continuous results. unique design maximizes the effective contact time by utilizing the full bulb length.UV Lights – 55watts\n"},"155":{"No":"155","product_name":"Your Choice Aquatics DC12000 (3200GPH) Water Pump","price":"","category":"","image":"81yQ-3lc9FL._AC_SX679_.jpg","description":"\nYour Choice Aquatics DC12000, can push 12000L\/H at 6 meter head and only use 10-100 watt. Quiet and Reliable, comes with 12 months warranty. Safe for reef and saltwater. Two modes, constant speed or pulsing to create wave.\n"},"156":{"No":"156","product_name":"PolypLab Reef Roids","price":"₹1575","category":"","image":"product_156.png","description":"\nReef-Roids is a blend of naturally occurring marine planktons, which contains a species of zooplankton that is unique to our product. It is formulated to minimize water degradation and is ideal for Goniapora, Zoanthids, Mushrooms, and all other filter feeding corals. With continued use, your corals will never experience faster growth and coloration!\n"},"157":{"No":"157","product_name":"PolypLab Reef Medic | Reef Safe White Spot Medication","price":"₹3699","category":"","image":"product_157.png","description":"\nReef-Roids is a blend of naturally occurring marine planktons, which contains a species of zooplankton that is unique to our product. It is formulated to minimize water degradation and is ideal for Goniapora, Zoanthids, Mushrooms, and all other filter feeding corals. With continued use, your corals will never experience faster growth and coloration!\n"},"158":{"No":"158","product_name":"Coral Feeder Pipette 35 cm","price":"₹350","category":"Salt mix & maintenance","image":"31Z43eR3GrL-1.jpg","description":"\nUsed in marine reef tank to feed coral directly. Arylic material, long life and never easy broken as glass. Also can be used for liquid fertilizer add in fresh water plant tank. An improved second-generation super powerful suction head. Add the head of soft material , not to hurt the corals. As a high-brightness acrylic tube body, you can see a clear feeding amount\n"},"159":{"No":"159","product_name":"Coral Feeder SPS HPS Feeder, Long and Short Version for Marine Fish and Reef Coral Aquarium CFT-1 CFT-2","price":"₹1061","category":"","image":"31HuSz8nTfL._AC_.jpg","description":""},"160":{"No":"160","product_name":"Filter Socks Small 4X11 200 Micron","price":"₹295","category":"","image":"21Mo9sc86KL.jpg","description":"\nFilter socks are the best form of mechanical filtration. This is an essential part for wet\/dry filter systems, sumps, and diy filters. Removes excess food, detritus, organic wastes, and other particulates to lower ammonia levels and other undesirable substances. Used as mechanical filtration for any sumps and diy filters\n"},"161":{"No":"161","product_name":"Filter Socks | 200 micron","price":"₹750","category":"","image":"161.png","description":"\nFilter socks are used to trap free floating debris which makes your tank water clear in appearance. This filter sock comes with a plastic ring which makes replacement quicker and easier and is compatible with all Fiji Cube sumps and most sumps available. \n"},"162":{"No":"162","product_name":"Coral Box Quiet Pump QPS-9 plus Wavemaker (Max 2375GPH)","price":"₹10208","category":"","image":"162.png","description":"\nThe new Coral Box QP series of pumps are possibly the quietest wave maker on the market! These new pumps use improved rubber mounts and impellers making them virtually inaudible.\n"},"163":{"No":"163","product_name":"Jebao WiFi Cross Flow Pump CP-25 \/ Silent CP-90 NJ","price":"","category":"","image":"image_show.jpeg","description":""},"164":{"No":"164","product_name":"Jebao CP-120 Cross Flow Pump Wave Maker with Controller","price":"₹8983","category":"","image":"61EibeBqsYL._AC_SX679_.jpg","description":"Crossflow technology makes the flow return to pump directly 360 degrees without dead spots create a different type of the flow similar to wave maker. Clockwise the flow as you set mode h: normal flow rate as the speed output w1: wave box function ~ idea for setting a pulse mode for set wave box function w2: normal mode with clockwise 4mins to 99mins w3: normal mode with reef mode feed mode 10mins."},"165":{"No":"165","product_name":"Jebao CP-150 Cross Flow Reef Water Pump, 6000-7500 GPH","price":"₹10290","category":"","image":"71eJi93ZG3L._AC_SX425_.jpg","description":"Crossflow technology makes the flow return to pump directly 360 degrees without dead spots create a different type of the flow similar to wavemaker. Clockwise the flow as you set mode h: normal flow rate as the speed output w1: wave box function ~ idea for setting a pulse mode for set wave box function w2: normal mode with clockwise 4mins to 99mins w3: normal mode with reef mode feed mode 10mins.        "},"":{"product_name":null,"price":null}}